/* global AFRAME, THREE */
let modelcheck = 0
// let target 
let targetcheck = 0;
let sc1mid 
 let   sc2mid
  let   rotation
  let lidrem;
  let preprem;
  let abtrem;
  let feedrem;
  let nutrirem;
  let ingrerem;
  let langvar=-1;
  let invisibleDiv
  function changelanguagefun(langvar) {
    console.log(langvar)
  
    const changelanguage = ['CHANGE<br>LANGUAGE', 'भाषा बदलें', 'ভাষা পরিবর্তন করুন', 'மொழியை மாற்றவும்', 'भाषा बदला', 'ভাষা সলনি কৰক', 'భాషను మార్చండి', 'ಭಾಷೆ ಬದಲಾಯಿಸಿ', 'ଭାଷା ପରିବର୍ତ୍ତନ କରନ୍ତୁ']
    const talktous = ['Talk to us', 'हमसे सम्पर्क करें', 'আমাদের সঙ্গে কথা বলুন', 'எங்களுடன் பேசுங்கள்', 'आमच्याशी बोला', 'আমাৰ সৈতে কথা পাতক', 'మాతో మాట్లాడండి', 'ನಮ್ಮೊಂದಿಗೆ ಮಾತನಾಡಿ', 'ଆମ ସହିତ କଥା ହୁଅନ୍ତୁ']
    const pleasescan = ['Please scan the pack', 'कृपया पैक को स्कैन करें', 'অনুগ্রহ করে প্যাকটিকে স্ক্যান করুন', 'பேக்கை ஸ்கேன் செய்யவும்', 'कृपया पॅक स्कॅन करा', 'অনুগ্ৰহ কৰি পেকেটখনক স্কেন কৰি লওঁক', 'దయచేసి ప్యాక్ స్కాన్ చేయండి', 'ದಯವಿಟ್ಟು ಪ್ಯಾಕ್‌ ಸ್ಕ್ಯಾನ್ ಮಾಡಿ', 'ଦୟାକରି ପ୍ୟାକ୍ କୁ ସ୍କାନ୍ କରନ୍ତୁ']
    const mothersmilk = ["Mother's milk is best for your baby", "मां का दूध आपके बच्चे के लिए सबसे सर्वोत्तम है", "অনুগ্রহ করে প্যাকটিকে স্ক্যান করুন", "பேக்கை ஸ்கேன் செய்யவும்", "तुमच्या बाळासाठी आईचे दूध सर्वोत्तम आहे", "আপোনাৰ সন্তানৰ বাবে মাতৃদুগ্ধই সৰ্বশ্ৰেষ্ঠ", "తల్లిపాలు మీ బిడ్డకు సర్వశ్రేష్టమైనవి", " ತಾಯಿಯ ಹಾಲು ನಿಮ್ಮ ಮಗುವಿಗೆ ಅತ್ಯುತ್ತಮ", "ମାଆ କ୍ଷୀର ଆପଣଙ୍କ ଶିଶୁ ପାଇଁ ସର୍ବୋତ୍ତମ"]
  
    const pointstowards = ['Point towards plane surface', 'समतल सतह की ओर', 'সমতলের দিকে নির্দেশ করুন', 'வெற்று மேற்பரப்பை நோக்கிக் காண்பியுங்கள்', 'सपाट पृष्ठभागाच्या दिशेत सूचित करा', 'সমান পিঠিৰ ফালে দিশ', 'చదునైన ఉపరితలం వైపు గురిపెట్టండి', 'ಸಪಾಟಾದ ಮೇಲ್ಮೈಯತ್ತ ತಿರುಗಿಸಿ', 'ସମତଳ ପୃଷ୍ଠଆଡକୁ ସୂଚିତ କରନ୍ତୁ']
   const taphere = ['Tap here  to place the Pack', 'पैक रखने के लिए यहां टैप करें', 'প্যাকটিকে রাখতে এখানে ট্যাপ করুন', 'பேக்கை வைப்பதற்கு இங்கே தட்டுங்கள்', 'पॅक ठेवण्यासाठी इथे टिचकी मारा', 'পেকেটখনক ৰাখিবলৈ ইয়াত টুকুৰিয়াই দিয়ক', 'ప్యాక్ ఉంచడానికి ఇక్కడ తాకండి', 'ಪ್ಯಾಕ್‌ ಇಡಲು ಇಲ್ಲಿ ಟ್ಯಾಪ್ ಮಾಡಿ', 'ପ୍ୟାକ୍ ରଖିବାକୁ ଏଠାରେ ଟ୍ୟାପ୍ କରନ୍ତୁ']
    // const rotate = ['Rotate to see more', 'और देखने के लिए घुमाएँ', 'আরও দেখতে ঘুরিয়ে নিন', 'மேலும் பார்ப்பதற்கு சுழற்றுங்கள்', 'आणखी पाहण्यासाठी फिरवा', 'অধিক চাবলৈ ঘুৰাই দিয়ক', 'మరింతగా చూడడానికి త్రిప్పండి', 'ಹೆಚ್ಚು ನೋಡಲು ತಿರುಗಿಸಿ', 'ଅଧିକ ଦେଖିବା ପାଇଁ ଘୂରାନ୍ତୁ']
  
    const WatchVideosmart = ['Watch Video', 'वीडियो देखें', 'ভিডিও দেখুন', 'வீடியோவை பார்க்கவும்', 'व्हिडियो पहा', 'ভিডিঅ’ চাওঁক', 'వీడియో చూడండి', ' ವಿಡಿಯೊ ವೀಕ್ಷಿಸಿ', 'ଭିଡିଓ ଦେଖନ୍ତୁ']
    const WatchAR = ['Watch in AR', 'AR में देखें', 'AR-এ দেখুন', 'AR இல் பார்க்கவும்', 'एआरमध्ये पहा', 'AR-ত চাওঁক', 'AR లో చూడండి', 'ಎಆರ್‌ನಲ್ಲಿ ವೀಕ್ಷಿಸಿ', 'ଏଆରରେ ଦେଖନ୍ତୁ']
  
    const WatchVideopreparation = ['Watch Video', 'वीडियो देखें', 'ভিডিও দেখুন', 'வீடியோவை பார்க்கவும்', 'व्हिडियो पहा', 'ভিডিঅ’ চাওঁক', 'వీడియో చూడండి', ' ವಿಡಿಯೊ ವೀಕ್ಷಿಸಿ', 'ଭିଡିଓ ଦେଖନ୍ତୁ']
  
    const MethodsPreparation = ['Methods of Preparation', 'तैयारी के तरीके', 'প্রস্তুত প্রণালী', 'தயாரிப்பு முறைகள்', 'बनवण्याच्या पद्धती', 'প্ৰস্তুত প্ৰণালী', 'తయారీ పద్ధతులు', 'ತಯಾರಿಸುವ ವಿಧಾನಗಳು', 'ପ୍ରସ୍ତୁତି ପ୍ରଣାଳୀ']
  
    const PREPARENANEXCELLAPRO = ['PREPARE NAN EXCELLAPRO IN A FEW SIMPLE STEPS',
      'निम्न चरणों में Nan Excellapro तैयार करें',
      'কয়েকটি ধাপে ন্যান এক্সেলাপ্রো প্রস্তুত করুন',
      'சில வழிமுறைகளில் நான் எக்ஸெல்லாபுரோவை தயார் செய்யுங்கள்',
      'थोड्या पायऱ्यांमध्ये नान एक्सेलप्रो बनवा',
      'কেইটামান খোজত নেনএক্সেলপ্ৰো তৈয়াৰ কৰক',
      'కొన్ని దశల్లో నాన్ ఎక్సెల్లాప్రో తయారు చేసుకోండి',
      ' ನ್ಯಾನ್ ಎಕ್ಸೆಲಪ್ರೋವನ್ನು ಕೆಲವೇ ಹೆಜ್ಜೆಗಳಲ್ಲಿ ತಯಾರಿಸಿ',
      'କିଛି ପର୍ଯ୍ୟାୟରେ Nan Excellapro ପ୍ରସ୍ତୁତ କରନ୍ତୁ']
  
    const Washyourhands = ['Wash your hands carefully',               
      'अपने हाथों को अच्छी तरह से धो लें',
      'যত্ন সহকারে হাত ধুয়ে নিন',
      'உங்கள் கைகளை கவனமாக கழுவுங்கள்',
      'तुमचे हात काळजीपूर्वक धुवा',
      'নিজৰ হাত দুখন ভালকৈ ধুই লওঁক',
      'మీ చేతుల్ని జాగ్రత్తగా కడుక్కోండి',
      'ನಿಮ್ಮ ಕೈಗಳನ್ನು ಚೆನ್ನಾಗಿ ತೊಳೆದುಕೊಳ್ಳಿ',
      'ସାବଧାନତାର ସହ ଆପଣଙ୍କର ହାତ ଧୁଅନ୍ତୁ']
  
    const Boilbottle = [' Boil bottle, bowl and spoon',
      'बोतल, बाउल और चम्मच को उबाल लें',
      'বোতল, বাটি ও চামচ গরম জলে ফুটিয়ে নিন',
      'பாட்டில், கிண்ணம் மற்றும் ஸ்பூனை கொதிக்கும் நீரில் அலசுங்கள்',
      ' बाटली, वाडगे आणि चमचा पाण्यात उकळवा',
      'বটল, বাটী আৰু চামুচ গৰম পানীত উতলাই লওঁক',
      'బాటిల్, గిన్నె మరియు స్పూన్ మరిగించండి',
      'ಬಾಟಲ್, ಬೌಲ್ ಮತ್ತು ಚಮಚೆಯನ್ನು ಕುದಿಸಿ',
      'ବୋତଲ, ଗିନା ଏବଂ ଚାମଚକୁ ଗରମ ପାଣିରେ ଫୁଟାନ୍ତୁ']
  
    const Boildrinkingwater = ['Boil drinking water and allow to cool',
      'पीने के पानी को उबाल कर ठंडा कर लें',
      'পানীয় জল ফুটিয়ে ঠাণ্ডা করে নিন',
      'குடிநீரை கொதிக்க வைத்து ஆற விடுங்கள்',
      'प्यायचे पाणी उकळवा आणि गार होऊ द्या',
      'খোৱা পানীক উতলাই লৈ ঠাণ্ডা হ’বলৈ থৈ দিয়ক',
      'త్రాగు నీటిని మరిగించి చల్లారనివ్వండి',
      'ಕುಡಿಯುವ ನೀರನ್ನು ಕುದಿಸಿ ತಣ್ಣಗಾಗಲು ಬಿಡಿ',
      'ପିଇବା ପାଣିକୁ ଫୁଟାଇ ଥଣ୍ଡା ହେବାକୁ ଦିଅନ୍ତୁ',]
  
  
    const Consultfeedingtable = ['Consult feeding table, pour exact amount of previously boiled water into bottle. Please look for the ml marking on bottle',
      'आहार तालिका का अनुसरण करते हुए, बोतल में पहले से उबाले गए पानी की सही मात्रा डालें। कृपया बोतल पर ml मार्किंग देखें।',
      'খাওয়ানোর সারণীটি দেখে আগে থেকে ফুটিয়ে রাখা সঠিক পরিমাণ জল বোতলে ঢালুন। অনুগ্রহ করে বোতলের ml চিহ্নটি দেখুন',
      'உணவூட்டும் அட்டவணையை பார்த்து, ஏற்கனவே கொதிக்க வைத்த தண்ணீரை சரியான அளவில் பாட்டிலில் ஊற்றுங்கள். பாட்டிலில் உள்ள மில்லி குறியீட்டை பாருங்கள்',
      ' फीडिंग टेबल घ्या, उकळवून ठेवलेले पाणी अचूक प्रमाणात बाटलीत ओता. कृपया बाटलीतील मिलीची खुण पहा.',
      'ফিডিং টেবুল চাওঁক, সঠিক পৰিমাণত আগতে উতলাই থোৱা পানী বটলত বাকি লওঁক। অনুগ্ৰহ কৰি বটলত ml-ৰ দাগ চাই ল’ব',
      'ఫీడింగ్ పట్టికను చూడండి, ఇంతకు మునుపు మరిగించిన నీటిని కచ్చితమైన పరిమాణములో బాటిల్ లోనికి పోయండి. దయచేసి బాటిల్ పైన ml మార్కింగ్ కోసం చూడండి',
      'ಫೀಡಿಂಗ್ ಟೇಬಲ್‌ ನೋಡಿ, ಮೊದಲೇ ಕುದಿಸಿದ ನೀರಿನ ನಿಖರವಾದ ಪ್ರಮಾಣವನ್ನು ಬಾಟಲಿಗೆ ಹಾಕಿ.ದಯವಿಟ್ಟು ಬಾಟಲಿ ಮೇಲೆ ಎಮ್‌ಎಲ್ ಗುರುತನ್ನು ನೋಡಿಕೊಳ್ಳಿ',
      'ଫିଡିଂ ଟେବୁଲ ଦେଖନ୍ତୁ, ବୋତଲରେ ପୂର୍ବରୁ ଫୁଟା ପାଣିର ସଠିକ ପରିମାଣ ଢାଳି ଦିଅନ୍ତୁ । ଦୟାକରି ବୋତଲରେ ମି.ଲି. ଚିହ୍ନଥିବା ସନ୍ଧାନ କରନ୍ତୁ']
  
  
    const Consultfeedingtable1 = ['Consult feeding table and add exact number of leveled scoops for age of baby. Shake bottle well to dissolve powder',
      'आहार तालिका का अनुसरण करते हुए शिशु की उम्र के अनुसार सही संख्या में संतुलित स्कूप डालें। पाउडर को सही तरह से घोलने के लिए बोतल को अच्छी तरह हिलाएं।',
      'খাওয়ানোর সারণীটি দেখে শিশুটির বয়স অনুযায়ী সঠিক সংখ্যায় ভর্তি করা চামচ মেশান পাউডার গোলার জন্য বোতলটি ভালভাবে ঝাঁকান',
      'உணவூட்டும் அட்டவணையை பார்த்து, குழந்தையின் வயதுக்கு ஏற்றவாறு துல்லியமான எண்ணிக்கையில் அளவிடப்பட்ட ஸ்கூப்களை சேருங்கள். பவுடர் கரையும் வரை பாட்டிலை நன்றாக குலுக்குங்கள்',
      ' फीडिंग टेबल घ्या आणि बाळाच्या वयानुसार अचूक संख्येत समपातळीत भरलेले स्कूप्स घाला. पावडर विरघळण्यासाठी बाटली व्यवस्थित हलवा',
      'ফিডিং টেবুল চাওঁক আৰু শিশুৰ বয়স অনুসৰি স্কুপ ভৰ্তি কৰি সঠিক পৰিমাণত মিহলাই দিয়ক। গুৰি যেন ভালকৈ মিহলি যায় তাৰ বাবে বটলটোক ভালকৈ জোকাৰি লওঁক।',
      'ఫీడింగ్ పట్టికను చూసి బిడ్డ వయస్సుకు తగ్గట్టు కచ్చితమైన సంఖ్యలో లెవెల్ చేసిన స్కూపులను వేయండి. పౌడరు కరిగిపోవడానికై బాటిల్ ని చక్కగా కదిలించండి',
      'ಫೀಡಿಂಗ್ ಟೇಬಲ್ ನೋಡಿ ಅದರಲ್ಲಿರುವಂತೆ ಮಗುವಿನ ವಯಸ್ಸಿನ ಪ್ರಕಾರ ನಿಖರವಾದ ಸಮ ಮಾಡಿದ ಸ್ಕೂಪ್‌ಗಳನ್ನು ಹಾಕಿ. ಪುಡಿಯನ್ನು ಕರಗಿಸಲು ಬಾಟಲಿಯನ್ನು ಅಲುಗಾಡಿಸಿ',
      'ଫିଡିଂ ଟେବୁଲ ଦେଖନ୍ତୁ ଏବଂ ଶିଶୁର ବୟସ ହିସାବରେ ମାପ କରି ସଠିକ୍ ସଂଖ୍ୟକ ସ୍କୁପ୍ ଢାଳନ୍ତୁ । ପାଉଡର ମିଳାଇଯିବା ପାଇଁ ବୋତଲକୁ ଫେଣ୍ଟନ୍ତୁ ।']
  
  
    const Feedbaby = ['Feed baby with bowl and spoon. Discord leftover feed',
      'शिशु को कटोरी और चम्मच से खिलाएं। बचे हुए आहार का उपयोग न करें',
      'চামচ আর বাটিতে করে শিশুটিকে খাওয়ান। বাড়তি খাদ্য ফেলে দিন',
      'கிண்ணம் மற்றும் கரண்டியால் குழந்தைக்கு ஊட்டுங்கள். மீதமுள்ள உணவை ஒதுக்கி விட வேண்டும்',
      ' बाळाला वाडगे आणि चमच्याने खाऊ घाला. राहिलेले अन्न फेकून द्या',
      'শিশুক বাটী আৰু চামুচেৰে খুৱাব। ৰৈ থোৱা খাদ্য পেলাই দিব।',
      'గిన్నె మరియు స్పూనుతో బిడ్డకు తినిపించండి. మిగిలిపోయిన ఆహారపదార్థాన్ని పారవేయండి',
      ' ಬೌಲ್ ಮತ್ತು ಚಮಚದಿಂದ ಮಗುವಿಗಿ ಉಣಿಸಿ. ಉಳಿದ ಆಹಾರವನ್ನು ತ್ಯಜಿಸಿ',
      'ଶିଶୁକୁ ଗିନା ଓ ଚାମଚରେ ଖୋଇଦିଅନ୍ତୁ । ଛାଡିଯାଇଥିବା ଖାଦ୍ୟକୁ ଫିଙ୍ଗି ଦିଅନ୍ତୁ ।']
  
  const WARNING=['WARNING','चेतावनी','সতর্কতা','எச்சரிக்கை','चेतावणी','সতৰ্কতা','హెచ్చరిక',' ಎಚ್ಚರಿಕೆ','ଚେତାବନୀ']
  const WARNING1=['WARNING: Unboiled water, unboiled utensils or incorrect dilution can make your baby ill. Incorrect storage, handling, preparation and feeding can potentially lead to adverse effects for the health of your baby.',
  'चेतावनी: बिना उबाला पानी, बिना उबाले बर्तन या गलत घोल-मात्रा के उपयोग से आपका शिशु बीमार हो सकता है। गलत भंडारण, रख-रखाव, तैयारी और खिलाना संभावित रूप से आपके शिशु के स्वास्थ्य पर प्रतिकूल प्रभाव डाल सकता है।','সতর্কতা: না ফোটানো জল, না ফোটানো পাত্র অথবা ভুল ভাবে পাতলা করলে আপনার সন্তানকে অসুস্থ করতে পারে। ভুল ভাবে স্টোর করলে, ব্যবহার করলে, প্রস্তুত করলে এবং খাওয়ানো হলে আপনার সন্তানের স্বাস্থ্যের ক্ষতি করতে পারে।','எச்சரிக்கை: கொதிக்க வைக்கப்படாத தண்ணீர், கொதிக்கும் தண்ணீரில் அலசப்படாத பாத்திரங்கள் அல்லது தவறான அளவில் தண்ணீர் சேர்ப்பதால் உங்கள் குழந்தை நோய்வாய்ப்படலாம். தவறாக சேமித்து வைத்தல், கையாளுதல், தயாரித்தல் மற்றும் ஊட்டுதல் ஆகியவை உங்கள் குழந்தையின் ஆரோக்கியத்திற்கு தீங்கு விளைவிக்கும் பாதிப்புகளுக்கு வழிவகுக்கலாம்.'
  ,'चेतावणी: न उकळलेले पाणी, गरम पाण्यात न धुतलेली भांडी आणि चुकीच्या डायल्युशनमुळे तुमचे बाळ आजारी पडू शकते. चुकीची साठवणूक, हाताळणी, बनवण्याची आणि खाऊ घालण्याची पद्धत तुमच्या बाळाच्या आरोग्यावर प्रतिकूल परिणाम करू शकतात.'
  ,'সাৱধান: পানী উতলাই নল’লে, বাচন উতলাই নল’লে বা সঠিক মাত্ৰাত মিহলাই নল’লে আপোনাৰ সন্তান অসুস্থ হৈ যাব পাৰে। খোৱা বস্তু ভালকৈ মজুত কৰি নথ’লে, ভালকৈ ব্যৱহাৰ নকৰিলে, ভালকৈ প্ৰস্তুত নকৰিলে, আৰু ভালকৈ খুৱাই নিদিলে আপোনাৰ সন্তানৰ স্বাস্থ্যৰ উপৰত প্ৰতিকূল প্ৰভাৱ পৰিব পাৰে।'
  ,'హెచ్చరిక: మరిగించని నీరు, మరిగించని పాత్రలు లేదా సరిగా పలచన చేయకపోవడం మీ బిడ్డను జబ్బుకు గురి చేయవచ్చు. సరిగ్గా నిల్వ చేయకపోవడం, చేపట్టడం, తయారీ మరియు ఫీడింగ్ మీ శిశువు ఆరోగ్యంపై సంభావ్యతగా ప్రతికూల పర్యవసానాలకు దారితీయవచ్చు.'
  ,'ಎಚ್ಚರಿಕೆ: ಕುದಿಸದ ನೀರು, ಕುದಿಸದ ಪಾತ್ರೆಗಳು ಅಥವಾ ಸರಿಯಲ್ಲದ ಸಾರಗುಂದಿಸಿಕೆ (ಡೈಲ್ಯೂಷನ್) ನಿಮ್ಮ ಮಗುವನ್ನು ಅಸ್ವಸ್ಥಗೊಳಿಸಬಹುದು. ಸರಿಯಲ್ಲದ ಸಂಗ್ರಹಣೆ, ನಿರ್ವಹಣೆ, ತಯಾರಿಕೆ ಮತ್ತು ಉಣಿಸುವಿಕೆ ನಿಮ್ಮ ಮಗುವಿನ ಆರೋಗ್ಯದ ಮೇಲೆ ದುಷ್ಪರಿಣಾಮಗಳಿಗೆ ಸಂಭಾವ್ಯವಾಗಿ ಕಾರಣವಾಗಬಹುದು.'
  ,'ଚେତାବନୀ: ଫୁଟା ହୋଇନଥିବା ପାଣି, ଫୁଟା ହୋଇନଥିବା ବାସନକୁସନ କିମ୍ବା ଭୁଲ ମିଶ୍ରଣ ଆପଣଙ୍କ ଶିଶୁକୁ ଅସୁସ୍ଥ କରିପାରେ । ଭୁଲ ଭଣ୍ଡାରଣ, ବ୍ୟବହାର, ପ୍ରସ୍ତୁତି ଏବଂ ଖୋଇଦେବା ସମ୍ଭାବ୍ୟ ରୂପରେ ଆପଣଙ୍କର ଶିଶୁର ସ୍ୱାସ୍ଥ୍ୟ ଉପରେ ପ୍ରତିକୂଳ ପ୍ରଭାବ ପକାଇବା ଆଡକୁ ନେଇପାରେ ।']
 
  const WARNING2=["Warning: Only prepare one feed at a time. Feed immediately and follow the instruction exactly. Boiled and cooled water shall be used to prepare this product and any leftover product must be discarded to reduce the risk of infection. Always hold baby while feeding. Leaving baby unattended may cause choking. Infant milk substitute should be used only on the advice of a health worker as to the need for its use and the proper method of its use. Infant milk substitute is not the sole source of nourishment of an infant. <br><br>\
  ^Warning/caution: Careful and hygienic preparation of infant milk substitue is most essential for health. Do not use fewer scoops than directed, since diluted feeding will not provide adequate nutrients needed by your infant.<br><br>\
  Close lid tightly after each use and always store this airtight container in a cool and dry place.<br><br>\
  After opening use the contents within 3 weeks or the use by date, whichever is earlier." ,

"चेतावनी: एक बार में केवल एक ही फीड तैयार करें। तुरंत खिलाएं और दिए गए निर्देशों का पालन करें। इस उत्पाद को तैयार करने के लिए पहले से उबला व गुनगुना पानी इस्तेमाल किया जाना चाहिए और संक्रमण के जोखिम को कम करने के लिए किसी भी बचे हुए उत्पाद का उपयोग नहीं किया जाना चाहिए। इसका सेवन कराते समय हमेशा शिशु को पकड़ कर रखें। शिशु को अनदेखा छोड़ने से उसका दम घुट सकता है। शिशु दूध विकल्प का उपयोग स्वास्थ्य कार्यकर्ता की सलाह पर ही करना चाहिए कि इसके उपयोग की आवश्यकता और इसके उपयोग की उचित विधि क्या है। शिशु के दूध का विकल्प शिशु के पोषण का एकमात्र स्रोत नहीं है।<br><br>\
^चेतावनी/ सावधानी: स्वास्थ्य के लिए शिशु के दूध के विकल्प की सावधानीपूर्वक और स्वच्छ तैयारी सबसे आवश्यक है। निर्देशित मात्रा से कम स्कूप का उपयोग न करें, क्योंकि पतला आहार आपके शिशु को पर्याप्त पोषक तत्व प्रदान नहीं करेगा।<br><br>\
 प्रत्येक उपयोग के बाद कसकर ढक्कन बंद कर दें और इस एयरटाइट कंटेनर को हमेशा ठंडी और सूखी जगह पर रखें।<br><br>\
 खोलने के बाद 3 सप्ताह के भीतर सामग्री का उपयोग कर लें या तिथि के अनुसार उपयोग करें, जो भी पहले हो।",

 "সতর্কতা: একবারে শুধুমাত্র একবারের মতো খাদ্য প্রস্তুত করুন। অবিলম্বে খাওয়ান এবং সঠিক ভাবে নির্দেশনা অনুসরণ করুন। ফোটানোর পরে ঠাণ্ডা করে নেওয়া জল দিয়ে এই খাদ্যটি প্রস্তুত করতে হবে, এবং সংক্রমণের আশংকা কমাতে অতিরিক্ত খাদ্য অবশ্যই ফেলে দিতে হবে। খাওয়ানোর সময় শিশুটিকে ধরে রাখবেন। অন্য কেউ উপস্থিত না থাকলে খাদ্য গলায় আটকে যাওয়ার সম্ভাবনা থাকে। শুধুমাত্র স্বাস্থ্যকর্মীর পরামর্শ অনুযায়ী শিশুকে দুধের বিকল্প দিতে হবে এবং সঠিক পদ্ধতিতে দিতে হবে। একটি শিশুর জন্য শুধুমাত্র শিশুর দুধের বিকল্পটি পুষ্টির একমাত্র উৎস নয়।<br><br>\
 ^সতর্কতা/সাবধানতা: সযত্নে ও স্বাস্থ্যসম্মত পদ্ধতিতে শিশুর দুধের বিকল্পটি প্রস্তুত করা স্বাস্থ্যের জন্য অপরিহার্য। নির্দেশিকাতে যত চামচ বলা আছে তার চেয়ে কম ব্যবহার করবেন না, যেহেতু পাতলা করে খাওয়ালে আপনার সন্তান প্রয়োজনীয় যথেষ্ট পুষ্টি পাবে না।<br><br>\
 প্রত্যেকবার ব্যবহারের পরে ঢাকনা শক্ত করে বন্ধ করবেন, এবং সর্বদা এই বায়ুনিরোধক কৌটটিকে ঠাণ্ডা ও শুকনো জায়গায় রাখবেন।<br><br>\
 খোলার পরে 3 সপ্তাহের মধ্যে অথবা দেওয়া তারিখের মধ্যে, যেটি আগে হয়, ব্যবহার করে ফেলবেন।",

 "எச்சரிக்கை: ஒரு நேரத்தில் ஒருமுறை ஊட்டும் அளவிற்கு மட்டுமே தயார் செய்யவும். உடனடியாக ஊட்ட வேண்டும் மற்றும் வழிமுறைகளை சரியாக பின்பற்ற வேண்டும். இந்த தயாரிப்பை தயார் செய்வதற்கு கொதிக்க வைத்து ஆற வைக்கப்பட்ட தண்ணீரைப் பயன்படுத்த வேண்டும், மேலும் தொற்றுநோய் ஏற்படும் ஆபத்தை குறைப்பதற்காக தயார் செய்யப்பட்ட மீதமிருக்கும் தயாரிப்பை ஒதுக்கி விட வேண்டும். ஊட்டும் போது எப்போதும் குழந்தையைப் பிடித்து கொள்ள வேண்டும். குழந்தையை கவனிக்காமல் விட்டு விட்டால் அடைத்துக் கொண்டு, மூச்சுத் திணறல் ஏற்படலாம். குழந்தைக்கான பால் மாற்று உணவை பயன்படுத்த வேண்டிய தேவைக்கேற்ப மற்றும் முறையாக பயன்படுத்தும் முறையில், சுகாதார பணியாளரின் ஆலோசனையின் பேரில் மட்டுமே இதை பயன்படுத்த வேண்டும். குழந்தைக்கான பால் மாற்று உணவு என்பது குழந்தையின் ஊட்டச்சத்திற்கான ஒரே ஆதாரம் அல்ல.<br><br>\
 ^எச்சரிக்கை/ஜாக்கிரதை: குழந்தைக்கான பால் மாற்று உணவை கவனமாகவும், சுகாதாரமாகவும் தயார் செய்ய வேண்டியது ஆரோக்கியத்திற்கு மிகவும் அவசியமாகும். அதிகம் தண்ணீர் சேர்க்கப்பட்ட உணவானது உங்கள் குழந்தைக்கு தேவைப்படும் போதுமான ஊட்டச்சத்துக்களை அளிக்காது என்பதால், பரிந்துரைக்கப்பட்டதை விட குறைவான ஸ்கூப்களை பயன்படுத்த வேண்டாம்,<br><br>\
 ஒவ்வொரு முறை பயன்படுத்திய பிறகும் மூடியை இறுக்கமாக மூடி, இந்த காற்றுப் புகாத கொள்கலனை<br><br>\
 திறந்த பிறகு, உள்ளேயுள்ள தயாரிப்பை 3 வாரங்களுக்குள் அல்லது தேதிக்குள், எது முதலில் வருகிறதோ அதற்குள் பயன்படுத்த வேண்டும்.",

 "चेतावणी: एकावेळी एकच खुराक बनवा. ताबडतोब खाऊ घाला आणि सूचनांचे अचूक पालन करा. हे उत्पादन बनवण्यासाठी उकळलेले आणि गार केलेले पाणी वापरले पाहिजे आणि खाऊन उरलेले पदार्थ संसर्गाची जोखीम टाळण्यासाठी फेकून दिले पाहिजे. बाळाला खाऊ घालताना त्याला नेहमी पकडून ठेवा. बाळाकडे लक्ष न दिल्यास गुदमरण्याची शक्यता असते. नवजात शिशुसाठीदुधाचा पर्याय त्याच्या गरजेसाठी आणि त्याच्या वापराच्या योग्य पद्धतीसाठी केवळ स्वास्थ्य कर्मचाऱ्याच्या सल्ल्यावर वापरावा. नवजात शिशुसाठी दुधाचा पर्याय बाळाच्या पोषणासाठी एकमेव स्रोत नसतो.<br><br>\
 चेतावणी/खबरदारी: नवजात शिशुसाठी दुधाचा पर्याय काळजीपूर्वक आणि स्वच्छतेने बनवणे आरोग्यासाठी अतिशय गरजेचे असते. निर्देशित केल्यापेक्षा कमी स्कुप्स घेऊ नका, कारण पातळ आहार तुमच्या नवजात शिशूला पुरेसे पोषण देऊ शकणार नाही.<br><br>\
 याला हवाबंद डब्बा प्रत्येक वापरानंतर घट्ट बंद करून नेहमी थंड आणि कोरड्या ठिकाणी ठेवा.<br><br>\
 उघडल्यावर यातील आशय 3 आठवड्यांमध्ये किंवा दिलेल्या तारखेपर्यंत, जे लवकर असेल, वापरा.",

 "সাৱধান: যেতিয়া যিখিনি খুৱাব কেৱল সিখিনিয়ে তৈয়াৰ কৰিব। খাদ্য তৈয়াৰ কৰাৰ লগে-লগে খুৱাই দিব আৰু নিৰ্দেশসমূহ সঠিক ভাৱে মানি চলিব। এই খাদ্যপণ্যক তৈয়াৰ কৰিবলৈ উতলাই লৈ ঠাণ্ডা কৰি লোৱা পানী ব্যৱহাৰ কৰিব লাগিব আৰু খাদ্যপণ্য ৰৈ গ’লে পেলাই দিব লাগে সংক্ৰমণৰ আশংকা হ্ৰাস কৰাৰ কাৰণে। সন্তানক খুৱাই দিয়াৰ সময়ত তাক সদায় ধৰি ৰাখিব। তাক খুৱাই দি এৰি দিলে তাৰ গলত খোৱা বস্তু বাজি যাব পাৰে। শিশুৰ বাবে গাখীৰৰ বিকল্পক কেৱল স্বাস্থ্যকৰ্মীৰ পৰামৰ্শ অনুসৰি ব্যৱহাৰ কৰিব লাগিব। তেওঁ কৈ দিব এয়া ব্যৱহাৰ কৰাৰ প্ৰয়োজন আছে নে নাই আৰু ইয়াক ব্যৱহাৰ কৰাৰ সঠিক পদ্ধতিও তেওঁ কৈ দিব। শিশুৰ বাবে গাখীৰৰ বিকল্প খাদ্য শিশুৰ পুষ্টিৰ একমাত্ৰ উৎস নহয়।<br><br>\
 ^সাৱধান/সতৰ্কতা: শিশুৰ বাবে গাখীৰৰ বিকল্প খাদ্যক সাৱধানে আৰু স্বাস্থ্যবিধি সন্মত ভাৱে তৈয়াৰ কৰাটো স্বাস্থ্যৰ বাবে সৰ্বাধিক আৱশ্যক হয়। যিমান স্কুৰ ব্যৱহাৰ কৰিবলৈ কোৱা হ’ব তাতকৈ কম পৰিমাণত ব্যৱহাৰ নকৰিব। কিয়নো অধিক এই খাদ্য অধিক পাতল হৈ গ’লে ই শিশুৰ বাবে প্ৰয়োজনীয় পৰ্যাপ্ত পুষ্টি দিব নোৱাৰিব।<br><br>\
 প্ৰত্যেক বাৰ ব্যৱহাৰ কৰাৰ পাছত ঢাকনখন ভালকৈ বন্ধ কৰি থ’ব আৰু এই এয়াৰটাইট কণ্টেইনাৰক ঠাণ্ডা আৰু শুকান ঠাইত থ’ব।<br><br>\
 ইয়াক খোলাৰ পাছত ইয়াৰ ভিতৰত থকা গোটেই বস্তুক 3 সপ্তাহৰ ভিতৰত ব্যৱহাৰ কৰি শেষ কৰিব বা ম্যাদ উকলি যোৱাৰ তাৰিখৰ আগতে শেষ কৰিব, যিটো আগতে হয়।",

 "హెచ్చరిక: ఒకేసారి ఒక ఫీడ్ మాత్రమే తయారు చేయండి. తక్షణమే తినిపించండి మరియు సూచనలను ఖచ్చితంగా పాటించండి. ఈ పదార్థాన్ని తయారు చేయడానికి మరిగించి చల్లార్చిన నీటిని ఉపయోగించాలి మరియు ఇన్ఫెక్షన్ తగ్గించడానికై మిగిలిపోయిన పదార్థాన్ని పారవేయాలి. తినిపించేటప్పుడు ఎల్లప్పుడూ బిడ్డను పట్టుకొని ఉండండి. బిడ్డ వద్ద ఎవరూ లేకుంటే ఉక్కిరిబిక్కిరికి కారణం కావచ్చు. శిశు పాల ప్రత్యామ్నాయ ఆహారాన్ని ఒక ఆరోగ్య కార్యకర్త సలహా ప్రకారం దాని వాడకం యొక్క అవసరము మరియు సరియైన వాడకపు పద్ధతి ప్రకారం మాత్రమే వాడాలి. శిశు పాల ప్రత్యామ్నాయం ఒక శిశువు యొక్క పోషణకు ఏకైక మూలము కాదు.<br><br>\
 ^హెచ్చరిక/జాగ్రత్త: శిశు పాల ప్రత్యామ్నాయాన్ని జాగ్రత్తగా మరియు ఆరోగ్యవంతంగా తయారు చేయడం ఆరోగ్యానికి అత్యంత ఆవశ్యకం. నిర్దేశించిన దానికంటే తక్కువ స్కూపులు వాడవద్దు, ఎందుకంటే పలచనగా ఉండే ఫీడింగ్ మీ బిడ్డకు కావలసినన్ని పోషకాలను కలిగి ఉండదు.<br><br>\
 వాడిన తర్వాత ప్రతిసారి మూతను గట్టిగా బిగించండి మరియు గాలి చొరబడని ఈ కంటైనర్‌ని చల్లని మరియు పొడిగా ఉన్న ప్రదేశములో భద్రపరచండి.<br><br>\
 ఓపెన్ చేసిన తర్వాత 3 వారాలకు ముందుగా లేదా గడువు తీరే తేదీకి ముందుగా, ఏది ముందు ఐతే దాని ప్రకారం పదార్థాలను వాడండి.",


 "ಎಚ್ಚರಿಕೆ: ಒಮ್ಮೆಗೆ ಒಂದೇ ಉಣಿಸನ್ನು ತಯಾರಿಸಿ. ಕೂಡಲೆ ಉಣಿಸಿ ಮತ್ತು ಸೂಚನೆಗಳನ್ನು ನಿಖರವಾಗಿ ಪಾಲಿಸಿ. ಈ ಉತ್ಪನ್ನವನ್ನು ತಯಾರಿಸಲು ಕುದಿಸಿ ತಣ್ಣಗಾಗಿಸಿದ ನೀರನ್ನು ಉಪಯೋಗಿಸತಕ್ಕದ್ದು ಮತ್ತು ಸೋಂಕಿನ ಅಪಾಯವನ್ನು ತಪ್ಪಿಸಲು ಯಾವುದೇ ಉಳಿದ ಉತ್ಪನ್ನವನ್ನು ತ್ಯಜಿಸಬೇಕು. ಉಣಿಸುವಾಗ ಯಾವಾಗಲೂ ಮಗುವನ್ನು ಕೈಯಲ್ಲಿ ಹಿಡಿದುಕೊಳ್ಳಿ. ಮಗುವಿನ ಮೇಲಿನ ಗಮನ ತಪ್ಪಿಸಿದರೆ ಅದು ಉಸಿರುಗಟ್ಟಬಹುದು. ಶಿಶು ಹಾಲು ಬದಲಿಯನ್ನು ಅದರ ಬಳಕೆಯ ಅವಶ್ಯಕತೆ ಮತ್ತು ಬಳಕೆಯ ಸರಿಯಾದ ವಿಧಾನದ ಬಗ್ಗೆ ಆರೋಗ್ಯ ಕಾರ್ಯಕರ್ತರ ಸಲಹೆ ಮೇರೆಗೆ ಮಾತ್ರ ಬಳಸತಕ್ಕದ್ದು. ಶಿಶು ಹಾಲು ಬದಲಿ ಒಂದು ಶಿಶುವಿಗೆ ಪೌಷ್ಟಿಕತೆಯ ಏಕೈಕ ಮೂಲವಲ್ಲ.<br><br>\
 ಎಚ್ಚರಿಕೆ: ಶಿಶು ಹಾಲಿನ ಬದಲಿಯ ಜಾಗರೂಕತೆಯ ಮತ್ತು ನಿರ್ಮಲ ತಯಾರಿಕೆ ಆರೋಗ್ಯಕ್ಕೆ ಅತ್ಯಾವಶ್ಯಕವಾಗಿದೆ. ಸೂಚಿಸಿರುವುದಕ್ಕಿಂತ ಕಡಿಮೆ ಸ್ಕೂಪ್‌ಗಳನ್ನು ಬಳಸಬೇಡಿ, ಏಕೆಂದರೆ ಸಾರಗುಂದಿಸಲ್ಪಟ್ಟ ಉಣಿಸು ನಿಮ್ಮ ಶಿಶುವಿಗೆ ಅಗತ್ಯವಿರುವ ಪರ್ಯಾಪ್ತ ಪೌಷ್ಟಿಕಾಂಶಗಳನ್ನು ಒದಗಿಸಲಾರದು.<br><br>\
 ಬಳಸಿದ ನಂತರ ಪ್ರತಿ ಬಾರಿ ಮುಚ್ಚಳವನ್ನು ಗಟ್ಟಿಯಾಗಿ ಮುಚ್ಚಿ ಮತ್ತು ಈ ಏರ್‌ಟೈಟ್ ಡಬ್ಬವನ್ನು ಯಾವಾಗಲೂ ತಂಪಾದ ಮತ್ತು ಶುಷ್ಕ ಜಾಗದಲ್ಲಿ ಸಂಗ್ರಹಿಸಿ<br><br>\
 ತೆರೆದ ನಂತರ, ಒಳಗಿರುವುದನ್ನು 3 ವಾರಗಳೊಳಗೆ ಅಥವಾ ವಾಯ್ದೆಯ ದಿನಾಂಕದೊಳಗೆ, ಯಾವುದು ಮೊದಲೋ ಅದರೊಳಗೆ, ಬಳಸಿ.",

 
 "ଚେତାବନୀ: ଗୋଟିଏ ସମୟରେ କେବଳ ଗୋଟିଏ ଖାଦ୍ୟ ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ସଙ୍ଗେ ସଙ୍ଗେ ଖାଦ୍ୟ ଖାଇବାକୁ ଦିଅନ୍ତୁ ଏବଂ ନିର୍ଦ୍ଦେଶାବଳୀକୁ ସମ୍ପୂର୍ଣ୍ଣ ଭାବେ ପାଳନ କରନ୍ତୁ। ଏହି ଉତ୍ପାଦ ପ୍ରସ୍ତୁତ କରିବା ପାଇଁ ସିଝା ଏବଂ ଥଣ୍ଡା ପାଣି ବ୍ୟବହାର କରାଯିବ ଏବଂ ସଂକ୍ରମଣ ର ଆଶଙ୍କା କୁ ହ୍ରାସ କରିବା ପାଇଁ କୌଣସି ବଳକା ଉତ୍ପାଦକୁ ଫିଙ୍ଗି ଦେବା ଉଚିତ୍ । ଖାଦ୍ୟ ଦେବା ସମୟରେ ଶିଶୁକୁ ସର୍ବଦା ଧରି ରଖନ୍ତୁ। ଶିଶୁକୁ ଅଣଦେଖା କରି ଛାଡି ଦେଲେ ଶ୍ୱାସରୁଦ୍ଧ ହୋଇପାରେ । ନବଜାତକ କ୍ଷୀରର ବିକଳ୍ପ ଏହାର ବ୍ୟବହାରର ଆବଶ୍ୟକତା ଏବଂ ଏହାର ଉପଯୁକ୍ତ ପଦ୍ଧତି କ'ଣ ତାହା କେବଳ ସ୍ୱାସ୍ଥ୍ୟକର୍ମୀଙ୍କ ପରାମର୍ଶକ୍ରମେ କରିବା ଉଚିତ । ନବଜାତକ କ୍ଷୀରର ବିକଳ୍ପ ଶିଶୁର ପୋଷଣର ଏକମାତ୍ର ଉତ୍ସ ନୁହେଁ ।<br><br>\
 ^ଚେତାବନୀ/ସାବଧାନତା: ନବଜାତକ କ୍ଷୀରର ବିକଳ୍ପ ପ୍ରସ୍ତୁତ କରିବା ସ୍ୱାସ୍ଥ୍ୟ ପାଇଁ ଅତ୍ୟନ୍ତ ଜରୁରୀ । ନିର୍ଦ୍ଧାରିତ ପରିମାଣଠାରୁ କମ୍ ସ୍କୁପ୍ ବ୍ୟବହାର କରନ୍ତୁ ନାହିଁ, କାରଣ ଏକ ମିଶ୍ରିତ ଖାଦ୍ୟ ଆପଣଙ୍କ ଶିଶୁକୁ ପର୍ଯ୍ୟାପ୍ତ ପୋଷକ ତତ୍ତ୍ୱ ପ୍ରଦାନ କରିବ ନାହିଁ।<br><br>\
 ପ୍ରତ୍ୟେକ ଥର ବ୍ୟବହାର କରିସାରିବା ପରେ ଢାଙ୍କୁଣୀକୁ ଦୃଢ ଭାବରେ ବନ୍ଦ କରନ୍ତୁ ଏବଂ ସର୍ବଦା ଏହି ବାୟୁରୋଧକ ପାତ୍ରକୁ ଥଣ୍ଡା ଏବଂ ଶୁଖିଲା ସ୍ଥାନରେ ରଖନ୍ତୁ।<br><br>\
 ସାମଗ୍ରୀ ଖୋଲିବାର 3 ସପ୍ତାହ ମଧ୍ୟରେ ବ୍ୟବହାର କରନ୍ତୁ କିମ୍ୱା ଦିଆଯାଇଥିବା ତାରିଖ ଅନୁଯାୟୀ ବ୍ୟବହାର କରନ୍ତୁ, ଯେଉଁଟି ପ୍ରଥମେ ହେବ।",]

  const feedingtable=['FEEDING TABLE','फीडिंग टेबल','খাওয়ানোর সারণী','உணவூட்டும் அட்டவணை','फीडिंग टेबल','ফিডিং টেবুল','ఫీడింగ్ పట్టిక','ಫೀಡಿಂಗ್ ಟೇಬಲ್','ଫିଡିଂ ଟେବୁଲ']
  const about=['ABOUT THE PRODUCT','उत्पाद के बारे में','পণ্যটি সম্বন্ধে','இந்தத் தயாரிப்பு பற்றி','उत्पादनाविषयी','পণ্যটোৰ বিষয়ে দুই আষাৰ','ఉత్పాదన గురించి','ಉತ್ಪನ್ನದ ಬಗ್ಗೆ','ଉତ୍ପାଦ ବିଷୟରେ']
  const abt=['ABOUT','बारे में','বিষয়ে','பற்றி','विषयी','ইয়াৰ বিষয়ে দুই আষাৰ','గురించి','ಕುರಿತು','ବିଷୟରେ']
  
  const abt1=['NAN EXCELLAPRO® 1 is a spray dried formula with Probiotic and HMOs# for infants from birth when they are not  breast fed. Please consult your healthcare professional for guidance.'
,'NAN EXCELLAPRO ® 1 जन्म से शिशुओं के लिए प्रोबायोटिक और HMOs# का एक स्प्रे-ड्राईड फार्मूला है जब उन्हें स्तनपान नहीं कराया जाता है। मार्गदर्शन के लिए कृपया अपने स्वास्थ्य देखभाल पेशेवर से सलाह लें।'
,'NAN EXCELLAPRO ® 1 হল প্রোবায়োটিক এবং HMOs # সহ একটি স্প্রে ড্রাই ফর্মুলা, যা জন্ম থেকেই শিশুদের দেওয়া হয় যদি তারা বুকের দুধ না পায়। নির্দেশিকার জন্য আপনার স্বাস্থ্য পরিষেবার পেশাদার ব্যক্তিদের পরামর্শ নিন।'
,"NAN EXCELLAPRO® 1 பிறந்ததில் இருந்து தாய்ப்பாலூட்டப்படாத குழந்தைகளுக்காக புரோபயாடிக் மற்றும் HMOs# கொண்டுள்ள ஸ்ப்ரே டிரைடு ஃபார்முலாவாகும். வழிகாட்டுதலுக்கு உங்கள் சுகாதார நிபுணரை அணுகவும்."
,'नान एक्सेलाप्रो®1 एक स्तनपान करवीत नसलेल्या बाळांसाठी जन्मापासून प्रोबायोटिक आणि एचएमओज#सह एक स्प्रे ड्राइड फॉर्म्युला आहे. मार्गदर्शनासाठी कृपया तुमच्या आरोग्यसेवा व्यावसायिकाशी संपर्क साधा.'
,'নেনএক্সেলপ্ৰো® 1 হ’ল এটা স্প্ৰে ড্ৰাইড ফৰ্মূলা ইয়াত সেইসকল শিশুৰ কাৰণে প্ৰোবায়োটিক আৰু HMOসমূহ# দি থোৱা হৈছে যিসকলক জন্মৰ পাছত স্তন্যপান কৰোৱা নহয়। এই সম্বন্ধে নিৰ্দেশনা পাবলৈ অনুগ্ৰহ কৰি আপোনাৰ স্বাস্থ্যসেৱা কৰ্মীৰ সৈতে কথা পাতি লওঁক।'
,'NAN EXCELLAPRO® 1 అనేది, శిశువులు జన్మించినపుడు వారికి తల్లిపాలు పట్టని సందర్భములో వారికి ప్రోబయాటిక్ మరియు HMOs# తో కూడిన పిచికారీ చేసే ఫార్ములా. మార్గదర్శనం కోసం దయచేసి మీ ఆరోగ్యసంరక్షణ నిపుణుడిని సంప్రదించండి.'
,'NAN EXCELLAPRO® 1 ಪ್ರೊಬಯಾಟಿಕ್ ಮತ್ತು HMOs＃ಹೊಂದಿರುವ, ಶಿಶುಗಳಿಗೆ ಮೊಲೆಯುಣಿಸದಿದ್ದಾಗ ಜನನದಿಂದ ಉಣಿಸುವ ಸ್ಪ್ರೇ ಡ್ರೈಡ್ ಫಾರ್ಮ್ಯುಲವಾಗಿದೆ. ಮಾರ್ಗದರ್ಶನಕ್ಕಾಗಿ ದಯವಿಟ್ಟು ನಿಮ್ಮ ಆರೋಗ್ಯ ಆರೈಕೆ ವೃತ್ತಿಪರರ ಸಲಹೆ ಪಡೆಯಿರಿ'
,'NAN EXCELLAPRO® 1 ହେଉଛି ଏକ ସିଂଚନ କରି ଶୁଷ୍କ କରାଯାଇଥିବା ସୂତ୍ର ଯେଉଁଥିରେ ପ୍ରୋବାୟୋଟିକ୍ସ ଏବଂ HMOs# ରହିଛି ଯାହାକି ଜନ୍ମରୁ ନବଜାତକମାନଙ୍କ ପାଇଁ ଯେତେବେଳେ ସେମାନେ ସ୍ତନ୍ୟପାନ କରନ୍ତି ନାହିଁ । ମାର୍ଗଦର୍ଶନ ପାଇଁ ଦୟାକରି ଆପଣଙ୍କ ସ୍ୱାସ୍ଥ୍ୟ ସେବା ପେସାଦାରଙ୍କ ସହ ପରାମର୍ଶ କରନ୍ତୁ।'
]
  
  const abt2=['HMOs# are oligosaccharides. 2’FL and LNnT are two of the most abundant HMOs.# #Not from Human Milk'
,"HMO# ओलिगोसेकेराइड हैं। 2'FL और LNnT दो सबसे प्रचुर मात्रा में HMO हैं।# मानव दूध से नहीं"
,"HMOs# হল ওলিগোস্যাকারাইড. 2’FL এবং LNnT হল দুটি সর্বাধিক লভ্য HMOs.# #মনুষ্য দুগ্ধ থেকে নয়"
,"HMOs# என்பவை ஒலிகோசாக்கரைடுகள் ஆகும். 2'FL மற்றும் LNnTஇரண்டும் மிகவும் அபரிமிதமான HMOகள்.# #தாய்ப்பாலில் இருந்து அல்ல"
,'एचएमओज# ऑलिगोसॅकराइड्स असतात. 2’एफएल आणि एलएनएनटी हे दोन्ही सर्वाधिक एचएमओज# आहेत. #मानवी दुधातून नाहीत.'
,'HMOসমূহ# হ’ল অলিগোছেকাৰাইডছ। সৰ্বাধিক পৰ্যাপ্ত পৰিমাণে উপলব্ধ HMOসমূহ# হ’ল 2’FL আৰু LNnT। #মানৱ-দুগ্ধৰপৰা নহয়'
,'HMOs# అనేవి ఒలిగోశాచరైడ్లు. 2’FL మరియు LNnT అనేవి అత్యంత దండిగా లభించే HMOsలలో రెండు.# #మనిషి పాల నుండి కాదు'
,'HMOs＃ಆಲಿಗೋಸ್ಯಾಕರೈಡ್‌ಗಳಾಗಿವೆ. 2’FL ಮತ್ತು LNnT ಹೇರಳವಾಗಿ ದೊರೆಯುವ ಎರಡು HMOs＃ ＃ಮಾನವ ಹಾಲಿನಿಂದಲ್ಲ'
,'HMOs# ହେଉଛି ଓଳିଗୋସାକାରାଇଡ୍ସ । 2’FL ଏବଂ LNnT ହେଉଛି ଏହାର ଦୁଇଟି ସବୁଠାରୁ ପ୍ରଚୁର HMOs.# #ମନୁଷ୍ୟ କ୍ଷୀରରୁ ନୁହେଁ'
]
  const abt3=['L.reuteri is a Probiotic. Under license from BioGaia AB.'
,'L.reuteri एक प्रोबायोटिक है। BioGaia AB से लाइसेंस के तहत।'
,'L. রয়টেরি একটি প্রোবায়োটিক। BioGaia AB থেকে প্রাপ্ত লাইসেন্সের অধীনে।'
,'L.ரியூட்டரி என்பது ஒரு புரோபயாடிக் ஆகும். பயோகயா AB இன் உரிமத்தின் கீழ்.'
,'L.reuteri एक प्रोबायोटिक आहे. बायोगायिया एबीकडून परवान्याच्या अंतर्गत.'
,'L.reuteri হ’ল এটা প্ৰোবায়োটিক। BioGaia AB-ৰপৰা লাইচেন্সৰ অধীনত।'
,'L.reuteri (ఎల్.రూటెరీ) అనేది ఒక ప్రోబయోటిక్. BioGaia AB నుండి లైసెన్స్ క్రింద.'
,'ಎಲ್.ರೂಟೆರಿ ಒಂದು ಪ್ರೊಬಯಾಟಿಕ್. BioGaia AB ಅವರಿಂದ ಪರವಾನಗಿ ಪಡೆದಿದೆ.'
,'ଏଲ୍. ରଏଟରୀ ହେଉଛି ଏକ ପ୍ରୋବାୟୋଟିକ୍ସ । BioGaia ABରୁ ଲାଇସେନ୍ସ ପ୍ରାପ୍ତ ।'
]

  const ingredients=['INGREDIENTS','सामग्री','উপকরণ','மூலப்பொருட்கள்',' घटक','উপকৰণ','కావలసిన పదార్థాలు',' ಸಾಮಗ್ರಿಗಳು','ଉପାଦାନଗୁଡିକ']
  const ing1=['Infant Formula with Probiotic and HMOs#'
  ,'प्रोबायोटिक और HMOs# के साथ शिशु फ़ॉर्मूला'
  ,'প্রোবায়োটিক এবং HMOs# সহ ইনফ্যান্ট ফর্মুলা'
  ,'புரோபயாடிக் மற்றும் HMOs உள்ள குழந்தை ஃபார்முலா#'
  ,' प्रोबायोटिक आणि एचएमओसह#नवजात शिशुसाठी फॉर्म्युला'
,'ইনফেণ্ট ফৰ্মূলা, য’ত আছে প্ৰোবায়োটিক আৰু HMOs#'
,'ప్రోబయోటిక్ మరియు HMOs#తో ఇన్‌స్టంట్ ఫార్ములా'
,' ಪ್ರೊಬಯಾಟಿಕ್ ಮತ್ತು HMOs# ಹೊಂದಿರುವ ಶಿಶು ಆಹಾರ'
,'Probiotic ଏବଂ HMOs# ସହିତ ନବଜାତକ ସୂତ୍ର'
]
  const ing2=['INGREDIENTS: Milk solids, Demineralised whey, Soyabean oil , Minerals , Low erucicrapeseed oil, Hign oleic sunflower oil,Emulsifier(Soya lecithin), Human Milk Oligosaccharides #(-2′-Fucosyllactose (2′-FL) and Lacto-N-Neotetraose (LNnT)) , Choline bitartrate , Arachidonic acid (ARA) from Mortierellla alpina oil, Docosahexaenoic acid (DHA) from Schizochytruim sp. oil, Vitamins, Amino acid(L-Phenylalaninel),Probiotic(Limosilactobacillus reuteri), Taurine , Acidity regulators (Citric Acid and Potassium hydroxide), Nucleotides,L-Carnitine and Packaging gases(Carbon dioxide and Nitrogen) INGREDIENTS AFTER RECONSTITUTION: Water, Milk solids, Demineralised whey Soyabean oil, Minerals, Low erucic rapeseed oil, High oleic sunflower oil, Coconut oil, Sunflower oll, Emulsifier (Soya lecithin), Human Milk Oligosaccharide (2ucosyllactose (2L) and Lacto-N-Neotetraose (LNnT)), Choline bitartrate, Arachidonic acid(ARA) from Mortierella alpina oil, Docosahexaenoic acid DHA from Schizochytium sp. oil, Vitamins, Amino acid(L-Phenylalanine), Probiotic (Limosilacfobacills reuterl), Taurine, Acidity regulators (Citric acid ond Potassiumhydroxide), Nucleotides, L-Carnitine and Packaging gases (Carbon dioxide and Nitrogen). Probiotic (Limosilactobacills revter} = 108- cfu/day based on recommended serving size. CONTAINS: Milk, Soy.'
,'सामग्री: दूध के ठोस पदार्थ, डिमिनरलाइज्ड व्हे, सोयाबीन का तेल, खनिज, कम इरूसिक रेपसीड तेल, उच्च ओलिक सूरजमुखी तेल, इमल्सीफायर (सोया लेसिथिन), मानव दूध ओलिगोसेकेराइड # (-2’-फ्यूकोसिलेक्टोज़ (2’-FL) और लैक्टो-एन-नियोटेट्रोज (LNnT)), मोर्टिएरेला एल्पिना ऑयल से कोलीन बिटार्ट्रेट, आर्किडोनिक एसिड (ARA), स्किज़ोकाइट्रुइम एसपी तेल से डोकोसाहेक्साएनोइक एसिड (DHA), विटामिन, अमीनो एसिड (L-फेनिलएलानिनेल), प्रोबायोटिक (लिमोसिलैक्टोबैसिलस रीयूटेरी), टॉरिन, एसिडिटी नियामक (साइट्रिक एसिड और पोटेशियम हाइड्रॉक्साइड), न्यूक्लियोटाइड्स, L-कार्निटाइन और पैकेजिंग गैसें (कार्बन डाइऑक्साइड और नाइट्रोजन)पुनर्निर्माण के बाद सामग्री: पानी, दूध के ठोस पदार्थ, डिमिनरलाइज्ड व्हे सोयाबीन तेल, खनिज, कम इरूसिक रेपसीड तेल, उच्च ओलिक सूरजमुखी तेल, नारियल का तेल, सूरजमुखी का तेल, इमल्सीफायर (सोया लेसिथिन), मानव दूध ओलिगोसेकेराइड (2यूकोसिलैक्टोज (2L) और लैक्टो-एन-नियोटेट्रोज (LNnT)), मोर्टिएरेला अल्पाइना तेल से कोलीन बिटार्ट्रेट, आर्किडोनिक एसिड (ARA), स्किज़ोचाइटियम एसपी से डोकोसाहेक्साएनोइक एसिड DHA। तेल, विटामिन, अमीनो एसिड (L-फेनिलएलनिन), प्रोबायोटिक (लिमोसिलैकफोबैसिल्स रीयूटेरी), टॉरिन, एसिडिटी नियामक (साइट्रिक एसिड और पोटेशियम हाइड्रॉक्साइड), न्यूक्लियोटाइड्स, L-कार्निटाइन और पैकेजिंग गैसें (कार्बन डाइऑक्साइड और नाइट्रोजन)। प्रोबायोटिक (लिमोसिलैक्टोबैसिल्स रिवर्टर} = 108 - cfu/दिन अनुशंसित सर्विंग आकार के आधार पर। इसमें शामिल हैं: दूध, सोया।'
,'উপকরণ: দুধের কঠিন পদার্থ, ডিমিনারলাইজড হোয়ে, সয়াবিন তেল, খনিজ পদার্থ, কম এরুসিক রেপসিড তেল, উচ্চ ওলেইক সূর্যমুখী তেল, ইমালসিফায়ার (সয়া লেসিথিন), হিউম্যান মিল্ক ওলিগোস্যাকারাইডস #(-2′-ফুকোসিল্যাকটোজ (2′-FL) এবং ল্যাক্টো-N-নিওটেট্রোজ (LNnT)), কোলিন বাইটারট্রেট, থেকে মর্টিয়ারেল্লা আল্পিনা তেল থেকে অ্যারাকিডোনিক অ্যাসিড, স্কিজোকাইট্রুইম স্পিসিস থেকে ডোকোসাহেক্সানোয়িক অ্যাসিড (DHA)। তেল, ভিটামিন, অ্যামিনো অ্যাসিড (L-ফিনাইলঅ্যালানিনেল), প্রোবায়োটিক (লিমোসিলাকফোব্যাসিলিস রয়টেরি), টাউরিন, অ্যাসিডিটি নিয়ন্ত্রক (সাইট্রিক অ্যাসিড এবং পটাসিয়াম হাইড্রক্সাইড), নিউক্লিওটাইডস, L-কার্নিটিন এবং প্যাকেজিং গ্যাস (কার্বন ডাই অক্সাইড এবং নাইট্রোজেন) পুনর্গঠনের পর উপাদান: জল, দুধের কঠিন পদার্থ, ডেমিনারালাইজড হুয়ে সয়াবিয়ান তেল, খনিজ পদার্থ, কম এরুকিক রেপসিড অয়েল, উচ্চ ওলিক সূর্যমুখী তেল, নারকেল তেল, সূর্যমুখী তেল, ইমালসিফায়ার (সয়া লেসিথিন), মনুষ্য দুধের ওলিগোস্যাকারাইড (2ইউকোসিল্যাক্টোস (2L) এবং ল্যাক্ট-N-নিওটেট্রোস (LNnT)), কোলাইন বাইটারট্রেট, মর্টিয়েরেলা আলপিনা তেল থেকে অ্যারাকিডনিক অ্যাসিড (ARA), স্কিজোকাইটিয়াম স্পিসিস থেকে ডোকোসাহেক্সেনয়িক অ্যাসিড DHA। তেল, ভিটামিন, অ্যামিনো অ্যাসিড (এল-ফিনাইলঅ্যালানিন), প্রোবায়োটিক (লিমোসিলাকফোব্যাসিলিস রয়টেরি), টাউরিন, অ্যাসিডিটি নিয়ন্ত্রক (সাইট্রিক অ্যাসিড ও পটাসিয়াম হাইড্রক্সাইড), নিউক্লিওটাইডস, L-কার্নিটিন এবং প্যাকেজিং গ্যাস (কার্বন ডাই অক্সাইড এবং নাইট্রোজেন)। প্রোবায়টিক (লিমোসিল্যাক্টোব্যাসিলস রেভটার} = 108 - cfu/দিন সুপারিশ করা পরিবেশনের পরিমাণের উপর ভিত্তি করে। উপকরণ: দুধ, সয়া।'
,'மூலப்பொருட்கள்: பால் திடப்பொருள்கள், கனிம நீக்கம் செய்யப்பட்ட மோர், சோயாபீன் எண்ணெய், மினரல்கள், குறைந்த எருசி கடுகு எண்ணெய், அதிக ஒலியிக் சூரியகாந்தி எண்ணெய், கூழ்மமாக்கி (சோயா லெசித்தின்), தாய்ப்பால் ஒலிகோசாக்கரைடுகள் #(-2′-ஃப்யூகோசிலாக்டோஸ் (2′-FL) மற்றும் லாக்டோ-N-நியோடெட்ராஸ் (LNnT)) , கோலைன் பிட்ராட்ரேட் , மோர்டிரெல்லால்பினா எண்ணெயில் இருந்து பெறப்படும் அராச்சிடோனிக் அமிலம் (ARA), ஸ்கிசோகைட்ரியத்தில் எஸ்பி யில் இருந்து பெறப்படும் டோகோஸஹெக்ஸெனோயிக் அமிலம் (DHA), எண்ணெய், அமினோ அமிலம்(L-ஃபெனிலாலனைன் L), புரோபயாடிக்(லிமோசிலாக்டோபாகிலஸ் ரியூட்டரி), டாரின், அமிலத்தன்மை கட்டுப்படுத்திகள் (சிட்ரிக் அமிலம் மற்றும் பொட்டாசியம் ஹைட்ராக்சைடு), நியூக்ளியோடைடுகள், L-கார்னைடைன் மற்றும் பேக்கேஜிங் வாயுக்கள்(கார்பன் டை ஆக்சைடு மற்றும் நைட்ரஜன்) மறுசீரமைப்பிற்கு பிந்தைய மூலப்பொருட்கள்: தண்ணீர், பால் திடப்பொருள்கள், கனிம நீக்கம் செய்யப்பட்ட மோர் சோயாபீன் எண்ணெய், மினரல்கள், குறைந்த எருசிக் ராப்சீட் எண்ணெய், அதிக ஒலியிக் சூரியகாந்தி எண்ணெய், தேங்காய் எண்ணெய், சூரியகாந்தி எண்ணெய், கூழ்மமாக்கி (சோயா லெசித்தின்), தாய்ப்பால் ஒலிகோசாக்கரைடுகள் #-2′-ஃப்யூகோசிலாக்டோஸ் (2′L) மற்றும் லாக்டோ-N-நியோடெட்ராஸ் (LNnT)) , கோலைன் பிட்ராட்ரேட் , மோர்டிரெல்லால்பினா எண்ணெயில் இருந்து பெறப்படும் அராச்சிடோனிக் அமிலம் (ARA), ஸ்கிசோகைட்ரியத்தில் எஸ்பியில் இருந்து பெறப்படும் டோகோஸஹெக்ஸெனோயிக் அமிலம் (DHA), எண்ணெய், வைட்டமின்கள், அமினோ அமிலம் (L-ஃபெனிலாலனைன்),புரோபயாடிக் (லிமோசிலாக்டோபாகிலஸ் ரியூட்டரி), டாரின், அமிலத்தன்மை கட்டுப்படுத்திகள் (சிட்ரிக் அமிலம் மற்றும் பொட்டாசியம் ஹைட்ராக்சைடு), நியூக்ளியோடைடுகள், L-கார்னைடைன் மற்றும் பேக்கேஜிங் வாயுக்கள்(கார்பன் டை ஆக்சைடு மற்றும் நைட்ரஜன்). புரோபயாடிக் (லிமோசிலாக்டோபாசில்ஸ்ரெவெட்டர்} = பரிந்துரைக்கப்பட்ட ஸர்விங் அளவு அடிப்படையில் 108- cfu/நாள் அடங்கியவை: பால், சோயா.'
,'घटक: मिल्क सॉलिडस, डिमिनरलाइज्ड व्हे, सोयाबीन तेल, खनिजे, कमी एरूसिक मोहरीचे तेल, हाय ओलेइक सूर्यफूल तेल, पायसकारी (सोया लेसिथिन), मानवी दूध ऑलिगोसॅकराइड्स #(-2′-फ्युकोसिलेक्टोज (2′-एफएल) आणि लॅक्टो-एन-निओटेट्राओज (एलएनएनटी)), कोलाइन बायटारटारेट, मोर्टिएरेल्ला अल्पिना तेलापासून अर्किडोनिक आम्ल, स्किझोकायट्रूम एसपी ऑईलमधून डोकोसाहेक्सेनोइक आम्ल (डीएचए),जीवनसत्त्वे, अमीनो आम्ल (एल-फिनाईलअलानिनेल), प्रोबायोटिक (लिमोसिलॅक्टोबॅसिलस र्युटेरी), टॉरिन, आम्लता नियामक (सायट्रिक आम्लआणि पोटॅशियम हायड्रॉक्साइड), न्यूक्लियोटाइड्स, एल-कार्निटाइन आणि पॅकेजिंग गॅसेस (कार्बन डायऑक्साइड आणि नायट्रोजन) पुनर्रचनेनंतरचे घटक: पाणी, मिल्क सॉलिड्स, डिमिनरलाइज्ड व्हे सोयाबीन तेल, खनिजे, लो इरुसिक मोहरीचे तेल, हाय ओलेइक सूर्यफूल तेल, खोबरेल तेल, सूर्यफूल तेल, पायसकारी(सोया लेसिथिन), मानवी दूध ऑलिगोसॅकराइड (2युकोसिलेक्टोज (2एल) आणि निओटे ट्रोज (एलएनएनटी)), कोलाइन बायटारटारेट, मोर्टिएरेल्ला अल्पिना तेलापासून अॅराकिडोनिक अॅसिड (एआरए), स्किझोकायट्रूम एसपी ऑईलमधून डोकोसाहेक्सेनोइक आम्ल (डीएचए), जीवनसत्त्वे, अमीनो आम्ल (एल- फिनाईलअलानिनेल), प्रोबायोटिक (लिमोसिलॅक्टोबॅसिलस र्युटेरी), टॉरिन, आम्लता नियामक (सायट्रिक आम्लआणि पोटॅशियम)हायड्रॉक्साइड), न्यूक्लियोटाइड्स, एल-कार्निटाइन आणि पॅकेजिंग गॅसेस(कार्बन डायऑक्साइड आणि नायट्रोजन). प्रोबायोटिक (लिमोसिलॅक्टोबॅसिलस र्युटेरी } = 108 - शिफारस केलेल्या सर्व्हिंगच्या आकारावर आधारित सीएफयू/दिन. समाविष्ट आहे: दूध, सोया.'
,'উপকৰণ: মিল্ক ছলিড, ডিমিনাৰেলাইজড হোৱে, ছয়াবীন তেল, মিনাৰেল, লো ইৰিউচিক ৰেপছীড তেল, হাই অ’লেইক সুৰূযমুখীৰ তেল, ইমালছিফায়াৰ (ছয়া লেচিটিন), হিউমেন মিল্ক অলিগোছেকাৰাইডছ #(-2′- ফিউকোছিলেক্টোজ (2′-FL) আৰু লেক্টো-এন-নিঅ’নেট্ৰাঅ’জ (LNnT)), কোলাইন বাইটাৰট্ৰেইট, মৰ্টিয়েৰেলা এলপিনা তেলৰপৰা এৰাকাইডনিক এচিড (ARA), স্কিজোকিট্ৰুইম এছপি. তেলৰপৰা ডকোছাহেক্সেনইক এচিড (DHA), ভিটামিন, এমিনো এচিড (এল-ফিনাইলালানাইনেল), প্ৰোবায়োটিক (লিমোছিলেক্টোবেচিলাছ ৰিউটেৰি), টৰাইণ, এচিডিটি ৰেগুলেটাৰসমূহ (চাইট্ৰিক এচিড আৰু পটাছিয়াম হাইড্ৰক্সাইড), নিউক্লিঅ’টাইডছ, এল-কাৰ্ণিটাইন আৰু পেকেজিং গেছসমূহ (কাৰ্বন ডাই অক্সাইড আৰু নাইট্ৰোজেন)পুনৰ্গঠনৰ পাছৰ উপকৰণ: পানী, মিল্ক ছলিড, ডিমিনাৰেলাইজড হোৱে ছয়াবীন তেল, মিনাৰেল, লো ইৰিউচিক ৰেপচীড তেল, হাই অ’লেইক সুৰূযমুখীৰ তেল, নাৰিকল তেল, সুৰূযমুখীৰ তেল, ইমালছিফায়াৰ (ছয়া লেচিটিন), হিউমেন মিল্ক অলিগোছেকাৰাইড (2ইউকোছাইলেক্টোজ (2L) আৰু লেক্টো-এন-নিউটেট্ৰাঅ’জ (LNnT)), কোলাইন বাইটাৰট্ৰেইট, মৰ্টিয়েৰেলা এলপিনা তেলৰপৰা এৰাকাইডনিক এচিড (ARA), স্কিজোকাইটিয়াম এছপি. তেলৰপৰা ডকোছাহেক্সেনইক এচিড DHA, ভিটামিন, এমিনো এচিড (এল-ফিনাইলালানাইন), প্ৰোবায়োটিক (লিমোছাইলেকফোবেচিল্স ৰিউটাৰ্ল), টৰাইণ, এচিডিটি ৰেগুলেটাৰসমূহ (চাইট্ৰিক এচিড আৰু পটাছিয়াম হাইড্ৰক্সাইড), নিউক্লিঅ’টাইডছ, এল-কাৰ্ণিটাইন আৰু পেকেজিং গেছসমূহ (কাৰ্বন ডাই অক্সাইড আৰু নাইট্ৰোজেন)। প্ৰোবায়োটিক (লিমোছাইলেক্টোবেছিল্স ৰেৱটাৰ} = 108 - cfu/দিন অনুমোদিত ছাৰ্ভিং ছাইজৰ ভিত্তিত। ইয়াত আছে: গাখীৰ, ছয়া।'
,'కావలసిన పదార్థాలు: పాల ఘనపదార్థాలు, మినరల్స్ తీసిన వే, సోయాబీన్ ఆయిల్, ఖనిజ లవణాలు, లో యూరూసిక్ రేప్‌సీడ్ ఆయిల్, హై ఓలియిక్ సన్‌ఫ్లవర్ ఆయిల్, ఎమల్షిఫయర్ (సోయా లెక్టిన్), హ్యూమన్ మిల్క్ ఒలిగోశాచరైడ్లు, #(-2′-ఫ్యుకోసిల్‌ల్యాక్టోస్ (2′-FL) మరియు ల్యాక్టో-N-నియోటెట్రాఓస్(LNnT)), కోలిన్ బైటార్ట్రేట్, మోర్టియెరెల్లా ఆయిల్ నుండి అరాచిడోనిక్ ఆసిడ్ (ARA), షిజోషైట్రియంsp. ఆయిల్ నుండి డొకోసాహెక్సాయినోయిక్ ఆసిడ్ (DHA), విటమిన్లు, ఎమినో ఆసిడ్ (L-ఫినైలాలానినెల్), ప్రోబయోటిక్(లైమోసిలాక్టోబేసిల్లస్ ర్యూటెరి), టారిన్, ఎసిడిటీ రెగ్యులేటర్లు (సిట్రిక్ ఆసిడ్ మరియు పొటాషియం హైడ్రాక్సైడ్), న్యూక్లియోటైడ్లు, L-కార్నిటైన్ మరియు ప్యాకేజింగ్ వాయువులు (కార్బన్ డయాక్సైడ్ మరియు నైట్రొజెన్)తిరిగి కలిపిన తర్వాత వేసే పదార్థాలు: నీరు, పాల ఘనపదార్థాలు, మినరల్స్ తీసిన వే సోయాబీన్ ఆయిల్, ఖనిజ లవణాలు, లో యూరూసిక్ రేప్‌సీడ్ ఆయిల్, హై ఓలియిక్ సన్‌ఫ్లవర్ ఆయిల్, కొబ్బరి నూనె, సన్‌ఫ్లవర్ ఆయిల్, ఎమల్షిఫయర్ (సోయా లెక్టిన్), హ్యూమన్ మిల్క్ ఒలిగోశాచరైడ్ (2యూకోసిల్లాక్టోస్ (2L), మరియు ల్యాక్టో-N-నియోటెట్రాఓస్ (LNnT)), కోలిన్ బైటార్ట్రేట్, మోర్టియెరెల్లా ఆల్పినా ఆయిల్ నుండి అరాచిడోనిక్ ఆసిడ్ (ARA), షిజోషైట్రియంsp. ఆయిల్ నుండి డొకోసాహెక్సాయినోయిక్ ఆసిడ్ (DHA), విటమిన్లు, ఎమినో ఆసిడ్ (L-ఫినైలాలానినెల్), ప్రోబయోటిక్(లైమోసిలాక్టోబేసిల్లస్ ర్యూటెరి), టారిన్, ఎసిడిటీ రెగ్యులేటర్లు (సిట్రిక్ ఆసిడ్ మరియు పొటాషియం హైడ్రాక్సైడ్), న్యూక్లియోటైడ్లు, L-కార్నిటైన్ మరియు ప్యాకేజింగ్ వాయువులు (కార్బన్ డయాక్సైడ్ మరియు నైట్రొజెన్). ప్రోబయోటిక్ (లైమోసిలాక్టోబేసిలిస్ రెవ్టర్} = సిఫార్సు చేయబడిన వడ్డన సైజు ఆధారంగా 108 - cfu/రోజుకు. ఈ క్రిందివాటిని కలిగి ఉంటుంది: పాలు, సోయా.'
,'ಸಾಮಗ್ರಿಗಳು: ಹಾಲಿನ ಘನ ಪದಾರ್ಥಗಳು, ಖನಿಜರಹಿತ ಹಾಲೊಡಕು, ಸೋಯಾಬೀನ್ ಎಣ್ಣೆ, ಖನಿಜಗಳು, ಕಡಿಮೆ ಎರೂಸಿಕ್ ರೇಪ್‌ಸೀಡ್ ಎಣ್ಣೆ, ಅಧಿಕ ಒಲೇಇಕ್ ಸೂರ್ಯಕಾಂತಿ ಎಣ್ಣೆ, ಎಮಲ್ಸಿಫೈಯರ್ (ಸೋಯಾ ಲೆಸಿತಿನ್), ಮಾನವ ಹಾಲಿನ ಆಲಿಗೊಸ್ಯಾಕರೈಡ್‌ಗಳು #(-2’-ಫ್ಯುಕೊಸಿಲ್ಯಾಕ್ಟೋಸ್ (2’-FL) ಮತ್ತು ಲ್ಯಾಕ್ಟೊ-ಎನ್-ನಿಯೊಟೆಟ್ರಾಓಸ್ (LNnT)), ಕೊಲಿನ್ ಬೈಟಾರ್ಟ್ರೇಟ್, ಮಾರ್ಟಿಯರೆಲ್ಲ ಆಲ್ಪಿನಾ ಎಣ್ಣೆಯಿಂದ ಅರಾಕಿಡೋನಿಕ್ ಆಸಿಡ್ (ಎಆರ್‌ಎ), ಸ್ಕಿಜೊಕಿಟ್ರುಯಿಮ್ ವಿಶೇಷ ಎಣ್ಣೆಯಿಂದ ಡೊಕೊಸಹೆಕ್ಸೇನಾಯಿಕ್ ಆಸಿಡ್ (ಡಿಎಚ್‌ಎ), ವಿಟಾಮಿನ್‌ಗಳು, ಅಮೈನೊ ಆಸಿಡ್ (ಎಲ್-ಫಿನೈಲನಾನಿನೆಲ್), ಪ್ರೊಬಯಾಟಿಕ್ (ಲೈಮೊಸಿಲ್ಯಾಕ್ಟೊಬ್ಯಾಸಿಲಸ್ ರೂಟೆರಿ), ಟಾರಿನ್, ಆಸಿಡಿಟಿ ನಿಯಂತ್ರಕಗಳು (ಸಿಟ್ರಿಕ್ ಆಸಿಡ್ ಮತ್ತು ಪೊಟ್ಯಾಶಿಯಮ್ ಹೈಡ್ರಾಕ್ಸೈಡ್), ನ್ಯೂಕ್ಲಿಯೊಟೈಡ್‌ಗಳು, ಎಲ್-ಕಾರ್ನಿಟೀನ್ ಮತ್ತು ಪ್ಯಾಕೇಜಿಂಗ್ ಗ್ಯಾಸ್‌ಗಳು (ಇಂಗಾಲಾಮ್ಲ ಮತ್ತು ನೈಟ್ರೊಜನ್) ಪುನರ್ನಿರ್ಮಾಣದ ನಂತರ ಸಾಮಗ್ರಿಗಳು: ನೀರು, ಹಾಲಿನ ಘನ ಪದಾರ್ಥಗಳು, ಖನಿಜರಹಿತ ಹಾಲೊಡಕು, ಸೋಯಾಬೀನ್ ಎಣ್ಣೆ, ಖನಿಜಗಳು, ಕಡಿಮೆ ಎರೂಸಿಕ್ ರೇಪ್‌ಸೀಡ್ ಎಣ್ಣೆ, ಅಧಿಕ ಒಲೇಇಕ್ ಸೂರ್ಯಕಾಂತಿ ಎಣ್ಣೆ, ತೆಂಗಿನೆಣ್ಣೆ, ಸೂರ್ಯಕಾಂತಿ ಎಣ್ಣೆ, ಎಮಲ್ಸಿಫೈಯರ್ (ಸೋಯಾ ಲೆಸಿತಿನ್), ಮಾನವ ಹಾಲಿನ ಆಲಿಗೊಸ್ಯಾಕರೈಡ್‌ಗಳು #(-2’-ಫ್ಯುಕೊಸಿಲ್ಯಾಕ್ಟೋಸ್ (2’-FL) ಮತ್ತು ಲ್ಯಾಕ್ಟೊ-ಎನ್-ನಿಯೊಟೆಟ್ರಾಓಸ್ (LNnT)), ಕೊಲಿನ್ ಬೈಟಾರ್ಟ್ರೇಟ್, ಮಾರ್ಟಿಯರೆಲ್ಲ ಆಲ್ಪಿನಾ ಎಣ್ಣೆಯಿಂದ ಅರಾಕಿಡೋನಿಕ್ ಆಸಿಡ್ (ಎಆರ್‌ಎ), ಸ್ಕಿಜೊಕಿಟ್ರುಯಿಮ್ ವಿಶೇಷ ಎಣ್ಣೆಯಿಂದ ಡೊಕೊಸಹೆಕ್ಸೇನಾಯಿಕ್ ಆಸಿಡ್ (ಡಿಎಚ್‌ಎ), ವಿಟಾಮಿನ್‌ಗಳು, ಅಮೈನೊ ಆಸಿಡ್ (ಎಲ್-ಫಿನೈಲನಾನಿನೆಲ್), ಪ್ರೊಬಯಾಟಿಕ್ (ಲೈಮೊಸಿಲ್ಯಾಕ್ಟೊಬ್ಯಾಸಿಲಸ್ ರೂಟೆರಿ), ಟಾರಿನ್, ಆಸಿಡಿಟಿ ನಿಯಂತ್ರಕಗಳು (ಸಿಟ್ರಿಕ್ ಆಸಿಡ್ ಮತ್ತು ಪೊಟ್ಯಾಶಿಯಮ್ ಹೈಡ್ರಾಕ್ಸೈಡ್), ನ್ಯೂಕ್ಲಿಯೊಟೈಡ್‌ಗಳು, ಎಲ್-ಕಾರ್ನಿಟೀನ್ ಮತ್ತು ಪ್ಯಾಕೇಜಿಂಗ್ ಗ್ಯಾಸ್‌ಗಳು (ಇಂಗಾಲಾಮ್ಲ ಮತ್ತು ನೈಟ್ರೊಜನ್) ಪ್ರೊಬಯಾಟಿಕ್ (ಲೈಮೊಸಿಲ್ಯಾಕ್ಟೊಬ್ಯಾಸಿಲಸ್ ರೆವ್ಟರ್) = 108 – ಸಿಎಫ್‌ಯು/ದಿನ (cfu/day) ಶಿಫಾರಸು ಮಾಡಲಾದ ಸರ್ವಿಂಗ್ ಗಾತ್ರ ಆಧಾರಿತ. ಹೊಂದಿದೆ: ಹಾಲು, ಸೋಯಾ.'
,"ଉପାଦାନଗୁଡିକ: ଘନଦୁଗ୍ଧ, ଡିମିନେରାଲାଇଜଡ୍ ହ୍ଵେ, ସୋୟାବିନ ତେଲ, ଖଣିଜ ପଦାର୍ଥ, ନିମ୍ନ ଏରୁକିକ୍ ରେପସିଡ୍ ତେଲ, ଉଚ୍ଚ ଓଲିକ୍ ସୂର୍ଯ୍ୟମୁଖୀ ତେଲ, ଇମଲ୍ସିଫାୟର (ସୋୟା ଲେସିଥିନ), ମାନବ କ୍ଷୀର ଓଲିଗୋସାକେରାଇଡ୍ # (-2'-ଫ୍ୟୁକୋସିଲାକ୍ଟୋଜ୍ (2'-ଏଫ୍ଏଲ୍) ଏବଂ ଲାକ୍ଟୋ-ଏନ୍-ନିଓଟେଟ୍ରୋଜ୍ (LNnT),କୋଲିନ୍ ବିଟାର୍ଟ୍ରେଟ୍, ମୋର୍ଟିଏରେଲା ଆଲ୍ପାଇନା ତେଲରୁ ଆରାଚିଡୋନିକ୍ ଏସିଡ୍ (ଏଆରଏ), ସ୍କିଜୋଚିଟିୟମ ବିଶେଷ ତେଲରୁ ଡୋକୋସାହେକ୍ସାନୋଇକ୍ ଏସିଡ୍, ଭିଟାମିନ୍, ଆମିନୋ ଏସିଡ୍ (ଏଲ୍-ଫେନିଲାନିନ୍), ପ୍ରୋବାୟୋଟିକ୍ (ଲିମୋସିଲାକଫୋବାସିଲ୍ସ ରଏଟରୀ), ଟାଉରିନ୍, ଏସିଡିଟି ନିୟନ୍ତ୍ରକ (ସାଇଟ୍ରିକ୍ ଏସିଡ୍ ଏବଂ ପୋଟାସିୟମ୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍), ନ୍ୟୁକ୍ଲିଓଟାଇଡ୍ସ, ଏଲ୍-କାର୍ନିଟିନ୍ ଏବଂ ପ୍ୟାକେଜିଂ ଗ୍ୟାସ୍ (ଅଙ୍ଗାରକାମ୍ଳ ଏବଂ ନାଇଟ୍ରୋଜେନ୍) ପୁନର୍ଗଠନ ପରେ ଉପାଦାନ: ଜଳ, କ୍ଷୀର କଠିନ ପଦାର୍ଥ, ଡିମିନେରାଲାଇଜଡ୍ ହ୍ଵେ, ସୋୟାବିନ ତେଲ, ଖଣିଜ ପଦାର୍ଥ, ନିମ୍ନ ଏରୁକିକ୍ ରେପସିଡ୍ ତେଲ, ଉଚ୍ଚ ଓଲିକ୍ ସୂର୍ଯ୍ୟମୁଖୀ ତେଲ, ନଡ଼ିଆ ତେଲ, ସୂର୍ଯ୍ୟମୁଖୀ ତେଲ, ଇମଲ୍ସିଫାୟର (ସୋୟା ଲେସିଥିନ୍), ମାନବ ଦୁଗ୍ଧ ଅଲିଗୋସେକରାଇଡ୍ (2ୟୁକୋସିଲାକ୍ଟୋଜ୍ (2L) ଏବଂ ଲାକ୍ଟୋ-ଏନ୍-ନିଓଟେଟ୍ରୋଜ୍ (LNnT),କୋଲିନ୍ ବିଟାର୍ଟେଟ୍, ମୋର୍ଟିଏରେଲା ଆଲପାଇନା ତେଲରୁ ଆରାକିଡୋନିକ୍ ଏସିଡ୍ (ଏଆରଏ), ସ୍କିଜୋଚିଟିୟମ ବିଶେଷ ତେଲରୁ ଡୋକୋସାହେକ୍ସାନୋଇକ୍ ଏସିଡ୍, ଭିଟାମିନ୍, ଆମିନୋ ଏସିଡ୍ (ଏଲ୍-ଫେନିଲାନିନ୍), ପ୍ରୋବାୟୋଟିକ୍ (ଲିମୋସିଲାକଫୋବାସିଲ୍ସ ରଏଟରୀ), ଟାଉରିନ୍, ଏସିଡିଟି ନିୟନ୍ତ୍ରକ (ସାଇଟ୍ରିକ୍ ଏସିଡ୍ ଏବଂ ପୋଟାସିୟମ୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍), ନ୍ୟୁକ୍ଲିଓଟାଇଡ୍ସ, ଏଲ୍-କାର୍ନିଟିନ୍ ଏବଂ ପ୍ୟାକେଜିଂ ଗ୍ୟାସ୍ (ଅଙ୍ଗାରକାମ୍ଳ ଏବଂ ନାଇଟ୍ରୋଜେନ୍)। ଦିନକୁ ପ୍ରୋବାୟୋଟିକ୍ (ଲିମୋସିଲାକ୍ଟୋବେସିଲ୍ସ ରେଭର୍ଟର) = 108 – cfu, ସୁପାରିଶ କରାଯାଇଥିବା ପରଷିବା ଆକାର ଉପରେ ଆଧାରିତ । ଏଥିରେ ରହିଛି: କ୍ଷୀର, ସୋୟା।"
]
// const ing3 = [''
// ,''
// ]
const nutrition=['NUTRITION INFORMATION','पोषण जानकारी','পুষ্টির তথ্য','ஊட்டச்சத்து விவரம்',' पोषणविषयक माहिती','পুষ্টি সম্বন্ধীয় তথ্য','పోషకాహార సమాచారము','ಪೌಷ್ಟಿಕಾಂಶ ಮಾಹಿತಿ','ପୋଷଣ ସୂଚନା']
const Return=['Return to experience','अनुभव के लिए लौटें','অভিজ্ঞতায় ফিরে যাওয়া','அனுபவத்திற்கு மீண்டும் திரும்பவும்',' अनुभवाकडे परत','অভিজ্ঞতাৰ ফল','అనుభవానికి తిరిగి రండి','ಅನುಭವಕ್ಕೆ ಹಿಂದಿರುಗಿ','ଅଭିଜ୍ଞତାକୁ ଫେରନ୍ତୁ']

const rotatearr=['Rotate to see more','देखने के लिए घुमाएँ','আরও দেখতে ঘুরিয়ে নিন','மேலும் பார்ப்பதற்கு சுழற்றுங்கள்','आणखी पाहण्यासाठी फिरवा'
,'অধিক চাবলৈ ঘুৰাই দিয়ক','మరింతగా చూడడానికి త్రిప్పండి','ಹೆಚ್ಚು ನೋಡಲು ತಿರುಗಿಸಿ','ଅଧିକ ଦେଖିବା ପାଇଁ ଘୂରାନ୍ତୁ']
const add1=['REACH OUT TO US','हमसे सम्पर्क करें','আমাদের সঙ্গে যোগাযোগ করুন','எங்களை அணுகுங்கள்',' अनुभवाकडे परत','আমাৰ সৈতে যোগাযোগ কৰক'
,'మమ్మల్ని సంప్రదించండి','ನಮ್ಮನ್ನು ಸಂಪರ್ಕಿಸಿ','ଆମ ପାଖରେ ପହଞ୍ଚନ୍ତୁ']
const add2=['P.O. BAG 2, NEW DELHI - 110001','पी.ओ.  बैग 2, नई दिल्ली - 110001','পি.ও.  ব্যাগ 2, নয়াদিল্লি - 110001','பி.ஓ.  பேக் 2, புது தில்லி - 110001'
,'पी.ओ. बॅग 2, नवी दिल्ली - 110001','পি.অ. বেগ ২, নতুন দিল্লী - ১১০০০১','పి.ఓ. బ్యాగ్ 2, న్యూఢిల్లీ - 110001','ಪಿ.ಓ. ಬ್ಯಾಗ್ 2, ಹೊಸ ದೆಹಲಿ - 110001','P.O. BAG 2, ନୂଆଦିଲ୍ଲୀ - 110001']
const modelList1=['/All Languages Hotspots/English/Smart Lid.glb'
,'/All Languages Hotspots/Hindi/Smart Lid.glb'
,'/All Languages Hotspots/Bengali/Smart Lid.glb'
,'/All Languages Hotspots/Tamil/Smart Lid.glb'
,'/All Languages Hotspots/Marathi/Smart Lid.glb'
,'/All Languages Hotspots/Assamese/Smart Lid.glb'
,'/All Languages Hotspots/Telegu/Smart Lid.glb'
,'/All Languages Hotspots/Kannada/Smart Lid.glb'
,'/All Languages Hotspots/Oriya/Smart Lid.glb']

const modelList2=['/All Languages Hotspots/English/About.glb'
,'/All Languages Hotspots/Hindi/About.glb'
,'/All Languages Hotspots/Bengali/About.glb'
,'/All Languages Hotspots/Tamil/About.glb'
,'/All Languages Hotspots/Marathi/About.glb'
,'/All Languages Hotspots/Assamese/About.glb'
,'/All Languages Hotspots/Telegu/About.glb'
,'/All Languages Hotspots/Kannada/About.glb'
,'/All Languages Hotspots/Oriya/About.glb']

const modelList3=['/All Languages Hotspots/English/Feeding.glb'
,'/All Languages Hotspots/Hindi/Feeding.glb'
,'/All Languages Hotspots/Bengali/Feeding.glb'
,'/All Languages Hotspots/Tamil/Feeding.glb'
,'/All Languages Hotspots/Marathi/Feeding.glb'
,'/All Languages Hotspots/Assamese/Feeding.glb'
,'/All Languages Hotspots/Telegu/Feeding.glb'
,'/All Languages Hotspots/Kannada/Feeding.glb'
,'/All Languages Hotspots/Oriya/Feeding.glb']

const modelList4=['/All Languages Hotspots/English/Preparation.glb'
,'/All Languages Hotspots/Hindi/Preparation.glb'
,'/All Languages Hotspots/Bengali/Preparation.glb'
,'/All Languages Hotspots/Tamil/Preparation.glb'
,'/All Languages Hotspots/Marathi/Preparation.glb'
,'/All Languages Hotspots/Assamese/Preparation.glb'
,'/All Languages Hotspots/Telegu/Preparation.glb'
,'/All Languages Hotspots/Kannada/Preparation.glb'
,'/All Languages Hotspots/Oriya/Preparation.glb']
const modelList5=['/All Languages Hotspots/English/Warning.glb'
,'/All Languages Hotspots/Hindi/Warning.glb'
,'/All Languages Hotspots/Bengali/Warning.glb'
,'/All Languages Hotspots/Tamil/Warning.glb'
,'/All Languages Hotspots/Marathi/Warning.glb'
,'/All Languages Hotspots/Assamese/Warning.glb'
,'/All Languages Hotspots/Telegu/Warning.glb'
,'/All Languages Hotspots/Kannada/Warning.glb'
,'/All Languages Hotspots/Oriya/Warning.glb']

const modelList6=['/All Languages Hotspots/English/Ingredients.glb'
,'/All Languages Hotspots/Hindi/Ingredients.glb'
,'/All Languages Hotspots/Bengali/Ingredients.glb'
,'/All Languages Hotspots/Tamil/Ingredients .glb'
,'/All Languages Hotspots/Marathi/Ingredients.glb'
,'/All Languages Hotspots/Assamese/Ingredients.glb'
,'/All Languages Hotspots/Telegu/Ingredients.glb'
,'/All Languages Hotspots/Kannada/Ingredients.glb'
,'/All Languages Hotspots/Oriya/Ingredients.glb']

const modelList7=['/All Languages Hotspots/English/Nutrition.glb'
                 ,'/All Languages Hotspots/Hindi/Nutrition.glb'
,'/All Languages Hotspots/Bengali/Nutrition.glb'
,'/All Languages Hotspots/Tamil/Nutrition.glb'
,'/All Languages Hotspots/Marathi/Nutrition.glb'
,'/All Languages Hotspots/Assamese/Nutrition.glb'
,'/All Languages Hotspots/Telegu/Nutrition.glb'
,'/All Languages Hotspots/Kannada/Nutrition.glb'
,'/All Languages Hotspots/Oriya/Nutrition.glb']
  
if(langvar===-1)
{
  langvar=0
}
    document.getElementById("talk").innerHTML = `${talktous[langvar]}`
    document.getElementById("changelang").innerHTML = `${changelanguage[langvar]}`
    document.getElementById("mother").innerHTML = `${mothersmilk[langvar]}`
    document.getElementById("pleasescan").innerHTML = `${pleasescan[langvar]}`
    document.getElementById("point").innerHTML = `${pointstowards[langvar]}`
    document.getElementById("taptoplace").innerHTML = `${taphere[langvar]}`
    document.getElementById("watchvideotext").innerHTML = `${WatchVideosmart[langvar]}`
    document.getElementById("watchartext").innerHTML = `${WatchAR[langvar]}`
    document.getElementById("title1").innerHTML = `${PREPARENANEXCELLAPRO[langvar]}`
    
    document.getElementById("step1").innerHTML = `${Washyourhands[langvar]}`
    document.getElementById("step2").innerHTML = `${Boilbottle[langvar]}`
    document.getElementById("step3").innerHTML = `${Boildrinkingwater[langvar]}`
    document.getElementById("step4").innerHTML = `${Consultfeedingtable[langvar]}`
    document.getElementById("step5").innerHTML = `${Consultfeedingtable1[langvar]}`
    document.getElementById("step6").innerHTML = `${Feedbaby[langvar]}`
    document.getElementById("title3").innerHTML = `${feedingtable[langvar]}`

    document.getElementById("title4").innerHTML = `${about[langvar]}`
    document.getElementById("abt").innerHTML = `${abt[langvar]}`

    document.getElementById("abt1").innerHTML = `${abt1[langvar]}`
    document.getElementById("abt2").innerHTML = `${abt2[langvar]}`
    document.getElementById("abt3").innerHTML = `${abt3[langvar]}`

    document.getElementById("title5").innerHTML = `${ingredients[langvar]}`
    document.getElementById("ing1").innerHTML = `${ing1[langvar]}`
    document.getElementById("ing2").innerHTML = `${ing2[langvar]}`
    document.getElementById("returnexp").innerHTML = `${Return[langvar]}`
    
    document.getElementById("rotatetext").innerHTML = `${rotatearr[langvar]}`
    document.getElementById("add1").innerHTML = `${add1[langvar]}`
    document.getElementById("add2").innerHTML = `${add2[langvar]}`
    
    document.getElementById("title7").innerHTML = `${WARNING[langvar]}`
    document.getElementById("w1").innerHTML = `${WARNING1[langvar]}`
    document.getElementById("w2").innerHTML = `${WARNING2[langvar]}`
    document.getElementById("nutritiontext").innerHTML = `${nutrition[langvar]}`




    lidhotspot.setAttribute('gltf-model', `${modelList1[langvar]}`) 
     hotAbout.setAttribute('gltf-model', `${modelList2[langvar]}`) 
     hotFeeding.setAttribute('gltf-model', `${modelList3[langvar]}`) 
     hotPreparation.setAttribute('gltf-model', `${modelList4[langvar]}`) 
    hotwarnaning.setAttribute('gltf-model', `${modelList5[langvar]}`) 
    hotingredient.setAttribute('gltf-model', `${modelList6[langvar]}`) 
    hotnutrition.setAttribute('gltf-model', `${modelList7[langvar]}`) 

    // const prep = document.getElementById('hotPreparation');
    // const feed = document.getElementById('hotFeeding');
    // const about = document.getElementById('hotAbout');
    // const warn = document.getElementById('hotwarnaning');
    // const nutri = document.getElementById('hotnutrition');
    // const ingre = document.getElementById('hotingredient');


  //   // const {src} = document.getElementById('imageFile')
  //   const loader = new THREE.TextureLoader()
  //   const lid = document.getElementById('lidhotspot');
  //     const model12 = lid.getObject3D('mesh').getObjectByName('About button - right.005')
  //     model12.material.map = loader.load('assets/texture/Smartlid.png')
  //     // set flipY to false to correclty rotate texture
  //     model12.material.map.flipY = false
  //  console.log("hey")



    


  
  
  
  }
AFRAME.registerComponent("code", {
    schema: {
      
    },
  
    init: function () {
      
 
 sc1mid = document.getElementById('screen1mid')
 const talk = document.getElementById('talk')
 const talkdiv = document.getElementById('white')
 const returne = document.getElementById('returnexp')
     sc2mid = document.getElementById('screen2mid')
     rotation = document.getElementById('rotate')
    
 
 talk.onclick = () => {
 // lidclcik.style.display = 'block'
 talk.style.display = 'none'
//  sc1mid.style.display = 'none'
 talkdiv.style.display = 'block'
 returne.style.display = 'block'
 }
 returne.onclick = () => {
 // lidclcik.style.display = 'block'
 talkdiv.style.display = 'none'
 returne.style.display = 'none'
 talk.style.display = 'block'
 //sc1mid.style.display = 'flex'
 }
 
        sc2mid.style.display = 'none'
        rotation.style.display = 'none'
       
    },
  
    tick: function () {
      
 //target = document.getElementById('nantarget');
 sc1mid = document.getElementById('screen1mid');
      sc2mid = document.getElementById('screen2mid');
      rotation = document.getElementById('rotate');
      
      const group = document.getElementById('group');
      
      const lid = document.getElementById('lidhotspot');
      const prep = document.getElementById('hotPreparation');
      const feed = document.getElementById('hotFeeding');
      const about = document.getElementById('hotAbout');
      const warn = document.getElementById('hotwarnaning');
      const nutri = document.getElementById('hotnutrition');
      const ingre = document.getElementById('hotingredient');

      const aboutdiv = document.getElementById('myabout');
      const aboutcancle = document.getElementById('aboutcancle');

      // const ingrediv = document.getElementById('ingredidentbox');
      const ingrediv = document.getElementById('myingredient');
      const ingrcancle = document.getElementById('ingrecancle');

      // const nutriediv = document.getElementById('nutritioinbox');
      const nutriediv = document.getElementById('mynutrition');
      const nutrecancle = document.getElementById('nutricancle');

      const watchar = document.getElementById('watchar');
      const liddiv = document.getElementById('trans');
      const feediv = document.getElementById('feeding');
      const myfeediv = document.getElementById('myfeeding');

      const prepdiv = document.getElementById('my');
      const prepcancle = document.getElementById('prepcancle');

      
      const warndiv = document.getElementById('warning');
      const warncancle = document.getElementById('warncan');


      const model = document.getElementById('model');
      const tap = document.getElementById('taptoplace');
      const lidcancle = document.getElementById('lidcancle');
      const feedcancle = document.getElementById('feedcancle');

      const bl = document.getElementById('bl')
      const video = document.getElementById('vid')
     const vidcancle = document.getElementById('vidcancle')

   
     const langBtn = document.getElementById('langBtn')
    const langSelection = document.getElementById('langSelection')

    const eng = document.getElementById('eng')
    const hin = document.getElementById('hin')
    const beng = document.getElementById('beng')
    const tam = document.getElementById('tam')
    const mara = document.getElementById('mara')
    const asam = document.getElementById('asam')
    const tel = document.getElementById('tel')
    const kan = document.getElementById('kan')
    const ori = document.getElementById('ori')

    langBtn.onclick = () => {
      langSelection.style.display = 'none'
      changelanguagefun(langvar)

    }

    // const changelang = document.getElementById('changelang')
    const changelangicon = document.getElementById('changelangicon')


    changelangicon.onclick = () => {
      langSelection.style.display = 'block'
      rotation.style.display="none"
    }
    eng.onclick = () => {
      console.log("select lang")
      langvar = 0
    }
    hin.onclick = () => {
      console.log("select lang")
      langvar = 1
    }
    beng.onclick = () => {
      console.log("select lang")
      langvar = 2
    }
    tam.onclick = () => {
      console.log("select lang")
      langvar = 3
    }
    mara.onclick = () => {
      console.log("select lang")
      langvar = 4
    }
    asam.onclick = () => {
      console.log("select lang")
      langvar = 5
    }
    tel.onclick = () => {
      console.log("select lang")
      langvar = 6
    }
    kan.onclick = () => {
      console.log("select lang")
      langvar = 7
    }
    ori.onclick = () => {
      console.log("select lang")
      langvar = 8
    }


     const {sceneEl} = this.el
     lid.setAttribute("visible","false")
      prep.setAttribute("visible","false")
      feed.setAttribute("visible","false")
      about.setAttribute("visible","false")
      //changes
      
      lidrem = 0;
      preprem = 0;
      abtrem = 0;
      feedrem = 0;
      nutrirem = 0;
      ingrerem = 0;
      console.log(group.object3D.rotation.y)
    if (
      ((group.object3D.rotation.y >= .8) && (group.object3D.rotation.y <= -0.2)) ||
    ((group.object3D.rotation.y >= 0.1) && (group.object3D.rotation.y <= 0.8)) ||
    ((group.object3D.rotation.y >= 3.1) && (group.object3D.rotation.y <= 3.9)) ||

    ((group.object3D.rotation.y >= 6.2) && (group.object3D.rotation.y <= 7.1)) ||
    ((group.object3D.rotation.y >= 9.3) && (group.object3D.rotation.y <= 10.2)) ||
    ((group.object3D.rotation.y >= 12.5) && (group.object3D.rotation.y <= 13.4)) ||

    



    ((group.object3D.rotation.y >= -5) && (group.object3D.rotation.y <= -6.2)) ||
    ((group.object3D.rotation.y >= -8.2) && (group.object3D.rotation.y <= -9.4)) ||
    
    ((group.object3D.rotation.y <= -2) && (group.object3D.rotation.y >= -3.1)) ||
    ((group.object3D.rotation.y <= -5.2) && (group.object3D.rotation.y >= -6.3)) ||
    ((group.object3D.rotation.y <= -8.2) && (group.object3D.rotation.y >= -9.4)) ||
    ((group.object3D.rotation.y <= -11.4) && (group.object3D.rotation.y >= -12.5))
    // ((group.object3D.rotation.y <= -3.1) && (group.object3D.rotation.y >= -2)) ||
    // ((group.object3D.rotation.y <= -6.3) && (group.object3D.rotation.y >= -5.2)) ||
    // ((group.object3D.rotation.y <= -9.4) && (group.object3D.rotation.y >= -8.2)) ||
    // ((group.object3D.rotation.y <= -12.5) && (group.object3D.rotation.y >= -11.4))
    ) {

    nutrirem = 1;
   
    console.log("nutri visible");
    nutri.setAttribute("visible", "true");
    nutri.setAttribute('animation-mixer', {
      clip: 'Animation',
      loop: 'once',
      crossFadeDuration: 0.1,
      clampWhenFinished: true
    });

  }
  if (nutrirem === 0) {
    nutri.removeAttribute('animation-mixer');
  }
  if (((group.object3D.rotation.y >= -0.66) && (group.object3D.rotation.y <= 0.66)) ||
  ((group.object3D.rotation.y >= 2.5) && (group.object3D.rotation.y <= 3.8)) ||
  ((group.object3D.rotation.y >= 5.6) && (group.object3D.rotation.y <= 7)) ||
  ((group.object3D.rotation.y >= 8.8) && (group.object3D.rotation.y <= 10.1)) ||
  ((group.object3D.rotation.y <= -2.6) && (group.object3D.rotation.y >= -3.6)) ||
  ((group.object3D.rotation.y <= -5.7) && (group.object3D.rotation.y >= -6.8)) ||
  ((group.object3D.rotation.y <= -8.8) && (group.object3D.rotation.y >= -10))) {

  lidrem = 1;
 
  // console.log("lid visible");
  lid.setAttribute("visible", "true");
  nutri.setAttribute("visible", "true");
  nutri.setAttribute('animation-mixer', {
    clip: 'Animation',
    loop: 'once',
    crossFadeDuration: 0.1,
    clampWhenFinished: true
  });
  lid.setAttribute('animation-mixer', {
    clip: 'Animation',
    loop: 'once',
    crossFadeDuration: 0.1,
    clampWhenFinished: true
  });


}


  if (lidrem === 0) {
    lid.removeAttribute('animation-mixer');
  }

  if (((group.object3D.rotation.y >= 0.65) && (group.object3D.rotation.y <= 1.5)) ||
    ((group.object3D.rotation.y >= 3.7) && (group.object3D.rotation.y <= 4.6)) ||
    ((group.object3D.rotation.y >= 6.8) && (group.object3D.rotation.y <= 7.8)) ||
    ((group.object3D.rotation.y >= 9.8) && (group.object3D.rotation.y <= 11)) ||
    ((group.object3D.rotation.y <= -1.6) && (group.object3D.rotation.y >= -2.6)) ||
    ((group.object3D.rotation.y <= -4.7) && (group.object3D.rotation.y >= -5.7)) ||
    ((group.object3D.rotation.y <= -7.8) && (group.object3D.rotation.y >= -8.8)) ||
    ((group.object3D.rotation.y <= -10.8) && (group.object3D.rotation.y >= -11.8))) {
    
    preprem = 1;
    
    prep.setAttribute("visible", "true");
    prep.setAttribute('animation-mixer', {
      clip: 'Animation',
      loop: 'once',
      crossFadeDuration: 0.1,
      clampWhenFinished: true
    });

  }
 
  if (preprem === 0) {
    prep.removeAttribute('animation-mixer');
  }

  if (((group.object3D.rotation.y >= 0.1) && (group.object3D.rotation.y <= 1.4)) ||
  ((group.object3D.rotation.y >= 3.2) && (group.object3D.rotation.y <= 4.5)) ||
  ((group.object3D.rotation.y >= 6.3) && (group.object3D.rotation.y <= 7.6)) ||
  ((group.object3D.rotation.y >= 9.5) && (group.object3D.rotation.y <= 10.8)) ||
  ((group.object3D.rotation.y <= -1.8) && (group.object3D.rotation.y >= -3)) ||
  ((group.object3D.rotation.y <= -5) && (group.object3D.rotation.y >= -6.2)) ||
  ((group.object3D.rotation.y <= -8.1) && (group.object3D.rotation.y >= -9.3)) ||
  ((group.object3D.rotation.y <= -11.2) && (group.object3D.rotation.y >= -12.4))) {
  
  ingrerem = 1;
  
  ingre.setAttribute("visible", "true");
  ingre.setAttribute('animation-mixer', {
    clip: 'Animation',
    loop: 'once',
    crossFadeDuration: 0.1,
    clampWhenFinished: true
  });

}

if (ingrerem === 0) {
  ingre.removeAttribute('animation-mixer');
}


   if(
    ((group.object3D.rotation.y>=1)    && (group.object3D.rotation.y<=2))          ||
    ((group.object3D.rotation.y>=4.1)    && (group.object3D.rotation.y<=5.1))       ||
    ((group.object3D.rotation.y>=7.2)     && (group.object3D.rotation.y<=10.3))       ||
    ((group.object3D.rotation.y>=10.3)   && (group.object3D.rotation.y<=11.3))       ||
    ((group.object3D.rotation.y<= -1.2)  && (group.object3D.rotation.y>= -2.2))      ||
    ((group.object3D.rotation.y<= -4.3)  && (group.object3D.rotation.y>= -5.3))     ||
    ((group.object3D.rotation.y<= -7.4) && (group.object3D.rotation.y>= -8.4))     ||
    ((group.object3D.rotation.y<= -10.6) && (group.object3D.rotation.y>= -11.6)) 
  ){
    
    feedrem = 1
    warn.setAttribute("visible","true")
    warn.setAttribute('animation-mixer', {
      clip: 'Animation',
      loop: 'once',
      crossFadeDuration: 0.1,
      clampWhenFinished : true
    })
    
  // console.log("feed visible")
    feed.setAttribute("visible","true")
    feed.setAttribute('animation-mixer', {
      clip: 'Animation',
      loop: 'once',
      crossFadeDuration: 0.1,
      clampWhenFinished : true
    })
  }
  if (feedrem === 0) {
    feed.removeAttribute('animation-mixer');
    warn.removeAttribute('animation-mixer');
  }
  if (((group.object3D.rotation.y >= 1.3) && (group.object3D.rotation.y <= 2.4)) ||
    ((group.object3D.rotation.y >= 4.4) && (group.object3D.rotation.y <= 5.5)) ||
    ((group.object3D.rotation.y >= 7.5) && (group.object3D.rotation.y <= 8.6)) ||
    ((group.object3D.rotation.y >= 10.7) && (group.object3D.rotation.y <= 11.8)) ||
    ((group.object3D.rotation.y <= -0.7) && (group.object3D.rotation.y >= -1.7)) ||
    ((group.object3D.rotation.y <= -3.9) && (group.object3D.rotation.y >= -4.9)) ||
    ((group.object3D.rotation.y <= -7) && (group.object3D.rotation.y >= -8)) ||
    ((group.object3D.rotation.y <= -10.1) && (group.object3D.rotation.y >= -11.8))) {
    
    abtrem = 1;
   
    
    about.setAttribute("visible", "true");
    about.setAttribute('animation-mixer', {
      clip: 'Animation',
      loop: 'once',
      crossFadeDuration: 0.1,
      clampWhenFinished: true
    });

  }
  if (abtrem === 0) {
    about.removeAttribute('animation-mixer');
  }

lid.onclick = () => {
// lidclcik.style.display = 'block'
liddiv.style.display = 'block'
rotation.style.display = 'none'


  
}

about.onclick = () => {
  console.log("about click")
// lidclcik.style.display = 'block'
aboutdiv.style.display = 'block'
rotation.style.display = 'none'
  
}
ingre.onclick = () => {
        
  // lidclcik.style.display = 'block'
  ingrediv.style.display = 'block';
  // ingremain.style.display = 'block';
  rotation.style.display = 'none';
  // console.log(" ingredient clicked")
};
nutri.onclick = () =>{
  nutriediv.style.display = 'block';
  // nutremain.style.display = 'block';
  rotation.style.display = 'none';
}

feed.onclick = () => {
// lidclcik.style.display = 'block'
feediv.style.display = 'block'
myfeediv.style.display = 'block'
rotation.style.display = 'none'
  
}

prep.onclick = () => {
// lidclcik.style.display = 'block'
prepdiv.style.display = 'block'
rotation.style.display = 'none'
  
}
warn.onclick = () => {
  // lidclcik.style.display = 'block'
  warndiv.style.display = 'block';
  rotation.style.display = 'none';

};
lidcancle.onclick = () => {
// lidclcik.style.display = 'none'
liddiv.style.display = 'none'
rotation.style.display = 'block'
  
}

aboutcancle.onclick = () => {
// lidclcik.style.display = 'none'
aboutdiv.style.display = 'none'
rotation.style.display = 'block'
  
}
ingrcancle.onclick = () => {
  // lidclcik.style.display = 'none'
  ingrediv.style.display = 'none';
  // ingremain.style.display = 'none';
  rotation.style.display = 'block';

};
nutrecancle.onclick = () => {
  // lidclcik.style.display = 'none'
  nutriediv.style.display = 'none';
  // nutremain.style.display = 'none';
  rotation.style.display = 'block';

};
prepcancle.onclick = () => {
// lidclcik.style.display = 'none'
prepdiv.style.display = 'none'
rotation.style.display = 'block'
  
}
warncancle.onclick = () => {
  // lidclcik.style.display = 'none'
  warndiv.style.display = 'none';
  rotation.style.display = 'block';

};

feedcancle.onclick = () => {
// lidclcik.style.display = 'none'
feediv.style.display = 'none'
myfeediv.style.display = 'none'
rotation.style.display = 'block'
  
}
vidcancle.onclick = () => {
  // lidclcik.style.display = 'none'
  bl.style.display = 'none'
 
    
  }
watchar.onclick = () => {
liddiv.style.display = 'none'

lid.setAttribute("scale","0 0 0")
         setTimeout(() => {
    model.setAttribute('animation-mixer', {
        clip: 'Animation',
        loop: 'once',
        crossFadeDuration: 0.1,
      })
  
}, 1500)
         setTimeout(() => {
  lid.setAttribute("scale","1 1 1")
  model.removeAttribute('animation-mixer')
}, 7500)



}
  
watchvideo.onclick = () => {
  bl.style.display="block"
  liddiv.style.display = 'none'
}

    //  if ((target.getAttribute('visible')) &&  (targetcheck === 0)) {
        if (  (targetcheck === 0)) {
          console.log("sssssssssssss")
        sc1mid.style.display = 'flex'
       sc2mid.style.display = 'none'
        lid.setAttribute("visible","false")
       modelcheck =1; 
      //  sc1mid.addEventListener('click', (event) => {
      //   sc1mid.style.display = 'none'
      //  sc2mid.style.display = 'block'
      //  })
       
              invisibleDiv.addEventListener('click', (event) => {
                
        
                invisibleDiv.style.display = "none"
             sc2mid.style.display = 'none'
             rotation.style.display = 'block'
    if(modelcheck === 1 ){
     
        sceneEl.emit('recenter')
        group.setAttribute('position',{z: 1})
        group.setAttribute('position',{y: -2})
      group.setAttribute("visible","true")
     
      // console.log("rotation = "+group.object3D.rotation.y)
      
       
    }
    modelcheck = 2;
    })

    targetcheck =1;
     }
 
    },
  });
  AFRAME.registerComponent("scaning", {
    init: function () {
      sc1mid = document.getElementById('screen1mid')
      sc2mid = document.getElementById('screen2mid')
      invisibleDiv = document.getElementById("invisibleDiv")
        this.el.sceneEl.addEventListener('zappar-visible', () => {
          sc1mid.style.display="none" 
        sc2mid.style.display = 'flex'
        invisibleDiv.style.display = "block"
    });
    }
})
  